arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430f5xx_6xxgeneric.h
/* RF1AIFCTL0 Control Bits */
#define RFFIFOEN            (0x0001u)  /* CC1101 Direct FIFO access enable */
#define RFENDIAN            (0x0002u)  /* CC1101 Disable endianness conversion */

/* RF1AIFCTL0 Control Bits */
#define RFFIFOEN_L          (0x0001u)  /* CC1101 Direct FIFO access enable */
#define RFENDIAN_L          (0x0002u)  /* CC1101 Disable endianness conversion */

/* RF1AIFCTL1 Control Bits */
#define RFRXIFG             (0x0001u)  /* Radio interface direct FIFO access receive interrupt flag */
#define RFTXIFG             (0x0002u)  /* Radio interface direct FIFO access transmit interrupt flag */
#define RFERRIFG            (0x0004u)  /* Radio interface error interrupt flag */
#define RFINSTRIFG          (0x0010u)  /* Radio interface instruction interrupt flag */
#define RFDINIFG            (0x0020u)  /* Radio interface data in interrupt flag */
#define RFSTATIFG           (0x0040u)  /* Radio interface status interrupt flag */
#define RFDOUTIFG           (0x0080u)  /* Radio interface data out interrupt flag */
#define RFRXIE              (0x0100u)  /* Radio interface direct FIFO access receive interrupt enable */
#define RFTXIE              (0x0200u)  /* Radio interface direct FIFO access transmit interrupt enable */
#define RFERRIE             (0x0400u)  /* Radio interface error interrupt enable */
#define RFINSTRIE           (0x1000u)  /* Radio interface instruction interrupt enable */
#define RFDINIE             (0x2000u)  /* Radio interface data in interrupt enable */
#define RFSTATIE            (0x4000u)  /* Radio interface status interrupt enable */
#define RFDOUTIE            (0x8000u)  /* Radio interface data out interrupt enable */

/* RF1AIFCTL1 Control Bits */
#define RFRXIFG_L           (0x0001u)  /* Radio interface direct FIFO access receive interrupt flag */
#define RFTXIFG_L           (0x0002u)  /* Radio interface direct FIFO access transmit interrupt flag */
#define RFERRIFG_L          (0x0004u)  /* Radio interface error interrupt flag */
#define RFINSTRIFG_L        (0x0010u)  /* Radio interface instruction interrupt flag */
#define RFDINIFG_L          (0x0020u)  /* Radio interface data in interrupt flag */
#define RFSTATIFG_L         (0x0040u)  /* Radio interface status interrupt flag */
#define RFDOUTIFG_L         (0x0080u)  /* Radio interface data out interrupt flag */

/* RF1AIFCTL1 Control Bits */
#define RFRXIE_H            (0x0001u)  /* Radio interface direct FIFO access receive interrupt enable */
#define RFTXIE_H            (0x0002u)  /* Radio interface direct FIFO access transmit interrupt enable */
#define RFERRIE_H           (0x0004u)  /* Radio interface error interrupt enable */
#define RFINSTRIE_H         (0x0010u)  /* Radio interface instruction interrupt enable */
#define RFDINIE_H           (0x0020u)  /* Radio interface data in interrupt enable */
#define RFSTATIE_H          (0x0040u)  /* Radio interface status interrupt enable */
#define RFDOUTIE_H          (0x0080u)  /* Radio interface data out interrupt enable */

/* RF1AIFERR Control Bits */
#define LVERR               (0x0001u)  /* Low Core Voltage Error Flag */
#define OPERR               (0x0002u)  /* Operand Error Flag */
#define OUTERR              (0x0004u)  /* Output data not available Error Flag */
#define OPOVERR             (0x0008u)  /* Operand Overwrite Error Flag */

/* RF1AIFERR Control Bits */
#define LVERR_L             (0x0001u)  /* Low Core Voltage Error Flag */
#define OPERR_L             (0x0002u)  /* Operand Error Flag */
#define OUTERR_L            (0x0004u)  /* Output data not available Error Flag */
#define OPOVERR_L           (0x0008u)  /* Operand Overwrite Error Flag */

/* RF1AIFERRV Definitions */
#define RF1AIFERRV_NONE     (0x0000u)  /* No Error pending */
#define RF1AIFERRV_LVERR    (0x0002u)  /* Low core voltage error */
#define RF1AIFERRV_OPERR    (0x0004u)  /* Operand Error */
#define RF1AIFERRV_OUTERR   (0x0006u)  /* Output data not available Error */
#define RF1AIFERRV_OPOVERR  (0x0008u)  /* Operand Overwrite Error */

/* RF1AIFIV Definitions */
#define RF1AIFIV_NONE       (0x0000u)  /* No Interrupt pending */
#define RF1AIFIV_RFERRIFG   (0x0002u)  /* Radio interface error */
#define RF1AIFIV_RFDOUTIFG  (0x0004u)  /* Radio i/f data out */
#define RF1AIFIV_RFSTATIFG  (0x0006u)  /* Radio i/f status out */
#define RF1AIFIV_RFDINIFG   (0x0008u)  /* Radio i/f data in */
#define RF1AIFIV_RFINSTRIFG (0x000Au)  /* Radio i/f instruction in */

/* RF1AIV Definitions */
#define RF1AIV_NONE         (0x0000u)  /* No Interrupt pending */
#define RF1AIV_RFIFG0       (0x0002u)  /* RFIFG0 */
#define RF1AIV_RFIFG1       (0x0004u)  /* RFIFG1 */
#define RF1AIV_RFIFG2       (0x0006u)  /* RFIFG2 */
#define RF1AIV_RFIFG3       (0x0008u)  /* RFIFG3 */
#define RF1AIV_RFIFG4       (0x000Au)  /* RFIFG4 */
#define RF1AIV_RFIFG5       (0x000Cu)  /* RFIFG5 */
#define RF1AIV_RFIFG6       (0x000Eu)  /* RFIFG6 */
#define RF1AIV_RFIFG7       (0x0010u)  /* RFIFG7 */
#define RF1AIV_RFIFG8       (0x0012u)  /* RFIFG8 */
#define RF1AIV_RFIFG9       (0x0014u)  /* RFIFG9 */
#define RF1AIV_RFIFG10      (0x0016u)  /* RFIFG10 */
#define RF1AIV_RFIFG11      (0x0018u)  /* RFIFG11 */
#define RF1AIV_RFIFG12      (0x001Au)  /* RFIFG12 */
#define RF1AIV_RFIFG13      (0x001Cu)  /* RFIFG13 */
#define RF1AIV_RFIFG14      (0x001Eu)  /* RFIFG14 */
#define RF1AIV_RFIFG15      (0x0020u)  /* RFIFG15 */

// Radio Core Registers
#define IOCFG2              0x00      /*  IOCFG2   - GDO2 output pin configuration  */
#define IOCFG1              0x01      /*  IOCFG1   - GDO1 output pin configuration  */
#define IOCFG0              0x02      /*  IOCFG1   - GDO0 output pin configuration  */
#define FIFOTHR             0x03      /*  FIFOTHR  - RX FIFO and TX FIFO thresholds */
#define SYNC1               0x04      /*  SYNC1    - Sync word, high byte */
#define SYNC0               0x05      /*  SYNC0    - Sync word, low byte */
#define PKTLEN              0x06      /*  PKTLEN   - Packet length */
#define PKTCTRL1            0x07      /*  PKTCTRL1 - Packet automation control */
#define PKTCTRL0            0x08      /*  PKTCTRL0 - Packet automation control */
#define ADDR                0x09      /*  ADDR     - Device address */
#define CHANNR              0x0A      /*  CHANNR   - Channel number */
#define FSCTRL1             0x0B      /*  FSCTRL1  - Frequency synthesizer control */
#define FSCTRL0             0x0C      /*  FSCTRL0  - Frequency synthesizer control */
#define FREQ2               0x0D      /*  FREQ2    - Frequency control word, high byte */
#define FREQ1               0x0E      /*  FREQ1    - Frequency control word, middle byte */
#define FREQ0               0x0F      /*  FREQ0    - Frequency control word, low byte */
#define MDMCFG4             0x10      /*  MDMCFG4  - Modem configuration */
#define MDMCFG3             0x11      /*  MDMCFG3  - Modem configuration */
#define MDMCFG2             0x12      /*  MDMCFG2  - Modem configuration */
#define MDMCFG1             0x13      /*  MDMCFG1  - Modem configuration */
#define MDMCFG0             0x14      /*  MDMCFG0  - Modem configuration */
#define DEVIATN             0x15      /*  DEVIATN  - Modem deviation setting */
#define MCSM2               0x16      /*  MCSM2    - Main Radio Control State Machine configuration */
#define MCSM1               0x17      /*  MCSM1    - Main Radio Control State Machine configuration */
#define MCSM0               0x18      /*  MCSM0    - Main Radio Control State Machine configuration */
#define FOCCFG              0x19      /*  FOCCFG   - Frequency Offset Compensation configuration */
#define BSCFG               0x1A      /*  BSCFG    - Bit Synchronization configuration */
#define AGCCTRL2            0x1B      /*  AGCCTRL2 - AGC control */
#define AGCCTRL1            0x1C      /*  AGCCTRL1 - AGC control */
#define AGCCTRL0            0x1D      /*  AGCCTRL0 - AGC control */
#define WOREVT1             0x1E      /*  WOREVT1  - High byte Event0 timeout */
#define WOREVT0             0x1F      /*  WOREVT0  - Low byte Event0 timeout */
#define WORCTRL             0x20      /*  WORCTRL  - Wake On Radio control */
#define FREND1              0x21      /*  FREND1   - Front end RX configuration */
#define FREND0              0x22      /*  FREDN0   - Front end TX configuration */
#define FSCAL3              0x23      /*  FSCAL3   - Frequency synthesizer calibration */
#define FSCAL2              0x24      /*  FSCAL2   - Frequency synthesizer calibration */
#define FSCAL1              0x25      /*  FSCAL1   - Frequency synthesizer calibration */
#define FSCAL0              0x26      /*  FSCAL0   - Frequency synthesizer calibration */
//#define RCCTRL1             0x27      /*  RCCTRL1  - RC oscillator configuration */
//#define RCCTRL0             0x28      /*  RCCTRL0  - RC oscillator configuration */
#define FSTEST              0x29      /*  FSTEST   - Frequency synthesizer calibration control */
#define PTEST               0x2A      /*  PTEST    - Production test */
#define AGCTEST             0x2B      /*  AGCTEST  - AGC test */
#define TEST2               0x2C      /*  TEST2    - Various test settings */
#define TEST1               0x2D      /*  TEST1    - Various test settings */
#define TEST0               0x2E      /*  TEST0    - Various test settings */

