arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430f5xx_6xxgeneric.h
/* status registers */
#define PARTNUM             0x30      /*  PARTNUM    - Chip ID */
#define VERSION             0x31      /*  VERSION    - Chip ID */
#define FREQEST             0x32      /*  FREQEST    – Frequency Offset Estimate from demodulator */
#define LQI                 0x33      /*  LQI        – Demodulator estimate for Link Quality */
#define RSSI                0x34      /*  RSSI       – Received signal strength indication */
#define MARCSTATE           0x35      /*  MARCSTATE  – Main Radio Control State Machine state */
#define WORTIME1            0x36      /*  WORTIME1   – High byte of WOR time */
#define WORTIME0            0x37      /*  WORTIME0   – Low byte of WOR time */
#define PKTSTATUS           0x38      /*  PKTSTATUS  – Current GDOx status and packet status */
#define VCO_VC_DAC          0x39      /*  VCO_VC_DAC – Current setting from PLL calibration module */
#define TXBYTES             0x3A      /*  TXBYTES    – Underflow and number of bytes */
#define RXBYTES             0x3B      /*  RXBYTES    – Overflow and number of bytes */

/* burst write registers */
#define PATABLE             0x3E      /*  PATABLE - PA control settings table */
#define TXFIFO              0x3F      /*  TXFIFO  - Transmit FIFO */
#define RXFIFO              0x3F      /*  RXFIFO  - Receive FIFO */

/* Radio Core Instructions */
/* command strobes               */
#define RF_SRES             0x30      /*  SRES    - Reset chip. */
#define RF_SFSTXON          0x31      /*  SFSTXON - Enable and calibrate frequency synthesizer. */
#define RF_SXOFF            0x32      /*  SXOFF   - Turn off crystal oscillator. */
#define RF_SCAL             0x33      /*  SCAL    - Calibrate frequency synthesizer and turn it off. */
#define RF_SRX              0x34      /*  SRX     - Enable RX. Perform calibration if enabled. */
#define RF_STX              0x35      /*  STX     - Enable TX. If in RX state, only enable TX if CCA passes. */
#define RF_SIDLE            0x36      /*  SIDLE   - Exit RX / TX, turn off frequency synthesizer. */
//#define RF_SRSVD            0x37      /*  SRVSD   - Reserved.  Do not use. */
#define RF_SWOR             0x38      /*  SWOR    - Start automatic RX polling sequence (Wake-on-Radio) */
#define RF_SPWD             0x39      /*  SPWD    - Enter power down mode when CSn goes high. */
#define RF_SFRX             0x3A      /*  SFRX    - Flush the RX FIFO buffer. */
#define RF_SFTX             0x3B      /*  SFTX    - Flush the TX FIFO buffer. */
#define RF_SWORRST          0x3C      /*  SWORRST - Reset real time clock. */
#define RF_SNOP             0x3D      /*  SNOP    - No operation. Returns status byte. */

#define RF_RXSTAT           0x80      /* Used in combination with strobe commands delivers number of availabe bytes in RX FIFO with return status */
#define RF_TXSTAT           0x00      /* Used in combination with strobe commands delivers number of availabe bytes in TX FIFO with return status */

/* other radio instr */
#define RF_SNGLREGRD        0x80
#define RF_SNGLREGWR        0x00
#define RF_REGRD            0xC0
#define RF_REGWR            0x40
#define RF_STATREGRD        0xC0      /* Read single radio core status register */
#define RF_SNGLPATABRD      (RF_SNGLREGRD+PATABLE)
#define RF_SNGLPATABWR      (RF_SNGLREGWR+PATABLE)
#define RF_PATABRD          (RF_REGRD+PATABLE)
#define RF_PATABWR          (RF_REGWR+PATABLE)
#define RF_SNGLRXRD         (RF_SNGLREGRD+RXFIFO)
#define RF_SNGLTXWR         (RF_SNGLREGWR+TXFIFO)
#define RF_RXFIFORD         (RF_REGRD+RXFIFO)
#define RF_TXFIFOWR         (RF_REGWR+TXFIFO)

#endif
/*************************************************************
* CRC Module
*************************************************************/
#ifdef  __MSP430_HAS_CRC__            /* Definition to show that Module is available */

#define OFS_CRCDI             (0x0000u)  /* CRC Data In Register */
#define OFS_CRCDI_L            OFS_CRCDI
#define OFS_CRCDI_H            OFS_CRCDI+1
#define OFS_CRCDIRB           (0x0002u)  /* CRC data in reverse byte Register */
#define OFS_CRCDIRB_L          OFS_CRCDIRB
#define OFS_CRCDIRB_H          OFS_CRCDIRB+1
#define OFS_CRCINIRES         (0x0004u)  /* CRC Initialisation Register and Result Register */
#define OFS_CRCINIRES_L        OFS_CRCINIRES
#define OFS_CRCINIRES_H        OFS_CRCINIRES+1
#define OFS_CRCRESR           (0x0006u)  /* CRC reverse result Register */
#define OFS_CRCRESR_L          OFS_CRCRESR
#define OFS_CRCRESR_H          OFS_CRCRESR+1

#endif
/************************************************************
* DAC12
************************************************************/
#ifdef  __MSP430_HAS_DAC12_2__          /* Definition to show that Module is available */

#define OFS_DAC12_0CTL0       (0x0000u)    /* DAC12_0 Control Register 0 */
#define OFS_DAC12_0CTL1       (0x0002u)    /* DAC12_0 Control Register 1 */
#define OFS_DAC12_0DAT        (0x0004u)    /* DAC12_0 Data */
#define OFS_DAC12_0CALCTL     (0x0006u)    /* DAC12_0 Calibration Control Register */
#define OFS_DAC12_0CALDAT     (0x0008u)    /* DAC12_0 Calibration Data Register */
#define OFS_DAC12_1CTL0       (0x0010u)    /* DAC12_1 Control Register 0 */
#define OFS_DAC12_1CTL1       (0x0012u)    /* DAC12_1 Control Register 1 */
#define OFS_DAC12_1DAT        (0x0014u)    /* DAC12_1 Data */
#define OFS_DAC12_1CALCTL     (0x0016u)    /* DAC12_1 Calibration Control Register */
#define OFS_DAC12_1CALDAT     (0x0018u)    /* DAC12_1 Calibration Data Register */
#define OFS_DAC12_IV          (0x001Eu)    /* DAC12   Interrupt Vector Word */

/* DAC12_xCTL0 Control Bits */
#define DAC12GRP            (0x0001u)    /* DAC12 group */
#define DAC12ENC            (0x0002u)    /* DAC12 enable conversion */
#define DAC12IFG            (0x0004u)    /* DAC12 interrupt flag */
#define DAC12IE             (0x0008u)    /* DAC12 interrupt enable */
#define DAC12DF             (0x0010u)    /* DAC12 data format */
#define DAC12AMP0           (0x0020u)    /* DAC12 amplifier bit 0 */
#define DAC12AMP1           (0x0040u)    /* DAC12 amplifier bit 1 */
#define DAC12AMP2           (0x0080u)    /* DAC12 amplifier bit 2 */
#define DAC12IR             (0x0100u)    /* DAC12 input reference and output range */
#define DAC12CALON          (0x0200u)    /* DAC12 calibration */
#define DAC12LSEL0          (0x0400u)    /* DAC12 load select bit 0 */
#define DAC12LSEL1          (0x0800u)    /* DAC12 load select bit 1 */
#define DAC12RES            (0x1000u)    /* DAC12 resolution */
#define DAC12SREF0          (0x2000u)    /* DAC12 reference bit 0 */
#define DAC12SREF1          (0x4000u)    /* DAC12 reference bit 1 */
#define DAC12OPS            (0x8000u)    /* DAC12 Operation Amp. */

#define DAC12AMP_0          (0*0x0020u)  /* DAC12 amplifier 0: off,    3-state */
#define DAC12AMP_1          (1*0x0020u)  /* DAC12 amplifier 1: off,    off */
#define DAC12AMP_2          (2*0x0020u)  /* DAC12 amplifier 2: low,    low */
#define DAC12AMP_3          (3*0x0020u)  /* DAC12 amplifier 3: low,    medium */
#define DAC12AMP_4          (4*0x0020u)  /* DAC12 amplifier 4: low,    high */
#define DAC12AMP_5          (5*0x0020u)  /* DAC12 amplifier 5: medium, medium */
#define DAC12AMP_6          (6*0x0020u)  /* DAC12 amplifier 6: medium, high */
#define DAC12AMP_7          (7*0x0020u)  /* DAC12 amplifier 7: high,   high */

#define DAC12LSEL_0         (0*0x0400u)  /* DAC12 load select 0: direct */
#define DAC12LSEL_1         (1*0x0400u)  /* DAC12 load select 1: latched with DAT */
#define DAC12LSEL_2         (2*0x0400u)  /* DAC12 load select 2: latched with pos. Timer_A3.OUT1 */
#define DAC12LSEL_3         (3*0x0400u)  /* DAC12 load select 3: latched with pos. Timer_B7.OUT1 */

