arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430f5xx_6xxgeneric.h
/* RTCTCCTL0 Control Bits */
#define TCEN                (0x0001u)   /* RTC Enable for RTC Tamper Detection with Time Stamp */
#define AUX3RST             (0x0002u)   /* RTC Indication of power cycle on AUXVCC3 */

/* RTCTCCTL1 Control Bits */
#define RTCCAPIFG           (0x0001u)   /* RTC  Tamper Event Interrupt Flag */
#define RTCCAPIE            (0x0002u)   /* RTC Tamper Event Interrupt Enable */

/* RTCCAPxCTL Control Bits */
#define CAPEV               (0x0001u)   /* RTC Tamper Event Flag */
#define CAPES               (0x0004u)   /* RTC Event Edge Select */
#define RTCREN              (0x0008u)   /* RTC RTCCAPx pin pullup/pulldown resistor enable */
#define RTCCAPIN            (0x0010u)   /* RTC RTCCAPx input */
#define RTCCAPDIR           (0x0020u)   /* RTC RTCCAPx Pin direction */
#define RTCCAPOUT           (0x0040u)   /* RTC RTCCAPx Output */

/* RTCIV Definitions */
#define RTCIV_NONE         (0x0000u)    /* No Interrupt pending */
#define RTCIV_RTCOFIFG     (0x0002u)    /* RTC Osc fault: RTCOFIFG */
#define RTCIV_RTCCAPIFG    (0x0004u)    /* RTC RTC Tamper Event: RTCCAPIFG */
#define RTCIV_RTCRDYIFG    (0x0006u)    /* RTC ready: RTCRDYIFG */
#define RTCIV_RTCTEVIFG    (0x0008u)    /* RTC interval timer: RTCTEVIFG */
#define RTCIV_RTCAIFG      (0x000Au)    /* RTC user alarm: RTCAIFG */
#define RTCIV_RT0PSIFG     (0x000Cu)    /* RTC prescaler 0: RT0PSIFG */
#define RTCIV_RT1PSIFG     (0x000Eu)    /* RTC prescaler 1: RT1PSIFG */

/* Legacy RTCIV Definitions */
#define RTC_NONE           (0x0000u)    /* No Interrupt pending */
#define RTC_RTCOFIFG       (0x0002u)    /* RTC Osc fault: RTCOFIFG */
#define RTC_RTCRDYIFG      (0x0006u)    /* RTC ready: RTCRDYIFG */
#define RTC_RTCTEVIFG      (0x0008u)    /* RTC interval timer: RTCTEVIFG */
#define RTC_RTCAIFG        (0x000Au)    /* RTC user alarm: RTCAIFG */
#define RTC_RT0PSIFG       (0x000Cu)    /* RTC prescaler 0: RT0PSIFG */
#define RTC_RT1PSIFG       (0x000Eu)    /* RTC prescaler 1: RT1PSIFG */

#endif
/************************************************************
* SD24_B - Sigma Delta 24 Bit
************************************************************/
#ifdef  __MSP430_HAS_SD24_B__         /* Definition to show that Module is available */

#define OFS_SD24BCTL0         (0x0000u)  /* SD24B Control Register 0 */
#define OFS_SD24BCTL0_L        OFS_SD24BCTL0
#define OFS_SD24BCTL0_H        OFS_SD24BCTL0+1
#define OFS_SD24BCTL1         (0x0002u)  /* SD24B Control Register 1 */
#define OFS_SD24BCTL1_L        OFS_SD24BCTL1
#define OFS_SD24BCTL1_H        OFS_SD24BCTL1+1
#define OFS_SD24BTRGCTL       (0x0004u)  /* SD24B Trigger Control Register */
#define OFS_SD24BTRGCTL_L      OFS_SD24BTRGCTL
#define OFS_SD24BTRGCTL_H      OFS_SD24BTRGCTL+1
#define OFS_SD24BTRGOSR       (0x0006u)  /* SD24B Trigger OSR Control Register */
#define OFS_SD24BTRGOSR_L      OFS_SD24BTRGOSR
#define OFS_SD24BTRGOSR_H      OFS_SD24BTRGOSR+1
#define OFS_SD24BTRGPRE       (0x0008u)  /* SD24B Trigger Preload Register */
#define OFS_SD24BTRGPRE_L      OFS_SD24BTRGPRE
#define OFS_SD24BTRGPRE_H      OFS_SD24BTRGPRE+1
#define OFS_SD24BIFG          (0x000Au)  /* SD24B Interrupt Flag Register */
#define OFS_SD24BIFG_L         OFS_SD24BIFG
#define OFS_SD24BIFG_H         OFS_SD24BIFG+1
#define OFS_SD24BIE           (0x000Cu)  /* SD24B Interrupt Enable Register */
#define OFS_SD24BIE_L          OFS_SD24BIE
#define OFS_SD24BIE_H          OFS_SD24BIE+1
#define OFS_SD24BIV           (0x000Eu)  /* SD24B Interrupt Vector Register */
#define OFS_SD24BIV_L          OFS_SD24BIV
#define OFS_SD24BIV_H          OFS_SD24BIV+1

#define OFS_SD24BCCTL0        (0x0010u)  /* SD24B Channel 0 Control Register */
#define OFS_SD24BCCTL0_L       OFS_SD24BCCTL0
#define OFS_SD24BCCTL0_H       OFS_SD24BCCTL0+1
#define OFS_SD24BINCTL0       (0x0012u)  /* SD24B Channel 0 Input Control Register */
#define OFS_SD24BINCTL0_L      OFS_SD24BINCTL0
#define OFS_SD24BINCTL0_H      OFS_SD24BINCTL0+1
#define OFS_SD24BOSR0         (0x0014u)  /* SD24B Channel 0 OSR Control Register */
#define OFS_SD24BOSR0_L        OFS_SD24BOSR0
#define OFS_SD24BOSR0_H        OFS_SD24BOSR0+1
#define OFS_SD24BPRE0         (0x0016u)  /* SD24B Channel 0 Preload Register */
#define OFS_SD24BPRE0_L        OFS_SD24BPRE0
#define OFS_SD24BPRE0_H        OFS_SD24BPRE0+1

#define OFS_SD24BMEML0        (0x0050u)  /* SD24B Channel 0 Conversion Memory Low word */
#define OFS_SD24BMEML0_L       OFS_SD24BMEML0
#define OFS_SD24BMEML0_H       OFS_SD24BMEML0+1
#define OFS_SD24BMEMH0        (0x0052u)  /* SD24B Channel 0 Conversion Memory High Word */
#define OFS_SD24BMEMH0_L       OFS_SD24BMEMH0
#define OFS_SD24BMEMH0_H       OFS_SD24BMEMH0+1

/* SD24BCTL0 */
#define SD24OV32            (0x0002u)  /* SD24B Overflow Control */
#define SD24REFS            (0x0004u)  /* SD24B Reference Select */
#define SD24SSEL0           (0x0010u)  /* SD24B Clock Source Select 0 */
#define SD24SSEL1           (0x0020u)  /* SD24B Clock Source Select 1 */
#define SD24M4              (0x0040u)  /* SD24B Modulator clock to Manchester decoder clock ratio */
#define SD24CLKOS           (0x0080u)  /* SD24B Clock Output Select */
#define SD24PDIV0           (0x0100u)  /* SD24B Frequency pre-scaler Bit 0 */
#define SD24PDIV1           (0x0200u)  /* SD24B Frequency pre-scaler Bit 1 */
#define SD24PDIV2           (0x0400u)  /* SD24B Frequency pre-scaler Bit 2 */
#define SD24DIV0            (0x0800u)  /* SD24B Frequency Divider Bit 0 */
#define SD24DIV1            (0x1000u)  /* SD24B Frequency Divider Bit 1 */
#define SD24DIV2            (0x2000u)  /* SD24B Frequency Divider Bit 2 */
#define SD24DIV3            (0x4000u)  /* SD24B Frequency Divider Bit 3 */
#define SD24DIV4            (0x8000u)  /* SD24B Frequency Divider Bit 4 */

#define SD24OV32_L          (0x0002u)  /* SD24B Overflow Control */
#define SD24REFS_L          (0x0004u)  /* SD24B Reference Select */
#define SD24SSEL0_L         (0x0010u)  /* SD24B Clock Source Select 0 */
#define SD24SSEL1_L         (0x0020u)  /* SD24B Clock Source Select 1 */
#define SD24M4_L            (0x0040u)  /* SD24B Modulator clock to Manchester decoder clock ratio */
#define SD24CLKOS_L         (0x0080u)  /* SD24B Clock Output Select */

