arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430f5xx_6xxgeneric.h
#define SD24PDIV0_H         (0x0001u)  /* SD24B Frequency pre-scaler Bit 0 */
#define SD24PDIV1_H         (0x0002u)  /* SD24B Frequency pre-scaler Bit 1 */
#define SD24PDIV2_H         (0x0004u)  /* SD24B Frequency pre-scaler Bit 2 */
#define SD24DIV0_H          (0x0008u)  /* SD24B Frequency Divider Bit 0 */
#define SD24DIV1_H          (0x0010u)  /* SD24B Frequency Divider Bit 1 */
#define SD24DIV2_H          (0x0020u)  /* SD24B Frequency Divider Bit 2 */
#define SD24DIV3_H          (0x0040u)  /* SD24B Frequency Divider Bit 3 */
#define SD24DIV4_H          (0x0080u)  /* SD24B Frequency Divider Bit 4 */

#define SD24SSEL_0          (0x0000u)  /* SD24B Clock Source Select MCLK  */
#define SD24SSEL_1          (0x0010u)  /* SD24B Clock Source Select SMCLK */
#define SD24SSEL_2          (0x0020u)  /* SD24B Clock Source Select ACLK  */
#define SD24SSEL_3          (0x0030u)  /* SD24B Clock Source Select TACLK */
#define SD24SSEL__MCLK      (0x0000u)  /* SD24B Clock Source Select MCLK  */
#define SD24SSEL__SMCLK     (0x0010u)  /* SD24B Clock Source Select SMCLK */
#define SD24SSEL__ACLK      (0x0020u)  /* SD24B Clock Source Select ACLK  */
#define SD24SSEL__SD24CLK   (0x0030u)  /* SD24B Clock Source Select SD24CLK */

#define SD24PDIV_0          (0x0000u)  /* SD24B Frequency pre-scaler  /1 */
#define SD24PDIV_1          (0x0100u)  /* SD24B Frequency pre-scaler  /2 */
#define SD24PDIV_2          (0x0200u)  /* SD24B Frequency pre-scaler  /4 */
#define SD24PDIV_3          (0x0300u)  /* SD24B Frequency pre-scaler  /8 */
#define SD24PDIV_4          (0x0400u)  /* SD24B Frequency pre-scaler  /16 */
#define SD24PDIV_5          (0x0500u)  /* SD24B Frequency pre-scaler  /32 */
#define SD24PDIV_6          (0x0600u)  /* SD24B Frequency pre-scaler  /64 */
#define SD24PDIV_7          (0x0700u)  /* SD24B Frequency pre-scaler  /128 */

/* SD24BCTL1 */
#define SD24GRP0SC          (0x0001u)  /* SD24B Group 0 Start Conversion */
#define SD24GRP1SC          (0x0002u)  /* SD24B Group 1 Start Conversion */
#define SD24GRP2SC          (0x0004u)  /* SD24B Group 2 Start Conversion */
#define SD24GRP3SC          (0x0008u)  /* SD24B Group 3 Start Conversion */
#define SD24DMA0            (0x0100u)  /* SD24B DMA Trigger Select Bit 0 */
#define SD24DMA1            (0x0200u)  /* SD24B DMA Trigger Select Bit 1 */
#define SD24DMA2            (0x0400u)  /* SD24B DMA Trigger Select Bit 2 */
#define SD24DMA3            (0x0800u)  /* SD24B DMA Trigger Select Bit 3 */

#define SD24GRP0SC_L        (0x0001u)  /* SD24B Group 0 Start Conversion */
#define SD24GRP1SC_L        (0x0002u)  /* SD24B Group 1 Start Conversion */
#define SD24GRP2SC_L        (0x0004u)  /* SD24B Group 2 Start Conversion */
#define SD24GRP3SC_L        (0x0008u)  /* SD24B Group 3 Start Conversion */

#define SD24DMA0_H          (0x0001u)  /* SD24B DMA Trigger Select Bit 0 */
#define SD24DMA1_H          (0x0002u)  /* SD24B DMA Trigger Select Bit 1 */
#define SD24DMA2_H          (0x0004u)  /* SD24B DMA Trigger Select Bit 2 */
#define SD24DMA3_H          (0x0008u)  /* SD24B DMA Trigger Select Bit 3 */

#define SD24DMA_0           (0x0000u)  /* SD24B DMA Trigger: 0 */
#define SD24DMA_1           (0x0100u)  /* SD24B DMA Trigger: 1 */
#define SD24DMA_2           (0x0200u)  /* SD24B DMA Trigger: 2 */
#define SD24DMA_3           (0x0300u)  /* SD24B DMA Trigger: 3 */
#define SD24DMA_4           (0x0400u)  /* SD24B DMA Trigger: 4 */
#define SD24DMA_5           (0x0500u)  /* SD24B DMA Trigger: 5 */
#define SD24DMA_6           (0x0600u)  /* SD24B DMA Trigger: 6 */
#define SD24DMA_7           (0x0700u)  /* SD24B DMA Trigger: 7 */
#define SD24DMA_8           (0x0800u)  /* SD24B DMA Trigger: 8 */

/* SD24BTRGCTL */
#define SD24SC              (0x0001u)  /* SD24B Start Conversion */
#define SD24SCS0            (0x0002u)  /* SD24B Start Conversion Select Bit 0 */
#define SD24SCS1            (0x0004u)  /* SD24B Start Conversion Select Bit 1 */
#define SD24SCS2            (0x0008u)  /* SD24B Start Conversion Select Bit 2 */
#define SD24SNGL            (0x0100u)  /* SD24B Single Trigger Mode */
#define SD24TRGIFG          (0x0400u)  /* SD24B Trigger Interrupt Flag */
#define SD24TRGIE           (0x0800u)  /* SD24B Trigger Interrupt Enable */

#define SD24SC_L            (0x0001u)  /* SD24B Start Conversion */
#define SD24SCS0_L          (0x0002u)  /* SD24B Start Conversion Select Bit 0 */
#define SD24SCS1_L          (0x0004u)  /* SD24B Start Conversion Select Bit 1 */
#define SD24SCS2_L          (0x0008u)  /* SD24B Start Conversion Select Bit 2 */

#define SD24SNGL_H          (0x0001u)  /* SD24B Single Trigger Mode */
#define SD24TRGIFG_H        (0x0004u)  /* SD24B Trigger Interrupt Flag */
#define SD24TRGIE_H         (0x0008u)  /* SD24B Trigger Interrupt Enable */

#define SD24SCS_0           (0x0000u)  /* SD24B Start Conversion Select: 0 */
#define SD24SCS_1           (0x0002u)  /* SD24B Start Conversion Select: 1 */
#define SD24SCS_2           (0x0004u)  /* SD24B Start Conversion Select: 2 */
#define SD24SCS_3           (0x0006u)  /* SD24B Start Conversion Select: 3 */
#define SD24SCS_4           (0x0008u)  /* SD24B Start Conversion Select: 4 */
#define SD24SCS_5           (0x000Au)  /* SD24B Start Conversion Select: 5 */
#define SD24SCS_6           (0x000Cu)  /* SD24B Start Conversion Select: 6 */
#define SD24SCS_7           (0x000Eu)  /* SD24B Start Conversion Select: 7 */
#define SD24SCS__SD24SC     (0x0000u)  /* SD24B Start Conversion Select: SD24SC */
#define SD24SCS__EXT1       (0x0002u)  /* SD24B Start Conversion Select: EXT1   */
#define SD24SCS__EXT2       (0x0004u)  /* SD24B Start Conversion Select: EXT2   */
#define SD24SCS__EXT3       (0x0006u)  /* SD24B Start Conversion Select: EXT3   */
#define SD24SCS__GROUP0     (0x0008u)  /* SD24B Start Conversion Select: GROUP0 */
#define SD24SCS__GROUP1     (0x000Au)  /* SD24B Start Conversion Select: GROUP1 */
#define SD24SCS__GROUP2     (0x000Cu)  /* SD24B Start Conversion Select: GROUP2 */
#define SD24SCS__GROUP3     (0x000Eu)  /* SD24B Start Conversion Select: GROUP3 */

/* SD24BIFG */
#define SD24IFG0            (0x0001u)  /* SD24B Channel 0 Interrupt Flag */
#define SD24OVIFG0          (0x0100u)  /* SD24B Channel 0 Overflow Interrupt Flag */

#define SD24IFG0_L          (0x0001u)  /* SD24B Channel 0 Interrupt Flag */

#define SD24OVIFG0_H        (0x0001u)  /* SD24B Channel 0 Overflow Interrupt Flag */

