arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430f5xx_6xxgeneric.h
/* SD24BIE */
#define SD24IE0             (0x0001u)  /* SD24B Channel 0 Interrupt Enable */
#define SD24OVIE0           (0x0100u)  /* SD24B Channel 0 Overflow Interrupt Enable */

#define SD24IE0_L           (0x0001u)  /* SD24B Channel 0 Interrupt Enable */

#define SD24OVIE0_H         (0x0001u)  /* SD24B Channel 0 Overflow Interrupt Enable */

/* SD24BIV Definitions */
#define SD24BIV_NONE         (0x0000u)    /* No Interrupt pending */
#define SD24BIV_SD24OVIFG    (0x0002u)    /* SD24OVIFG */
#define SD24BIV_SD24TRGIFG   (0x0004u)    /* SD24TRGIFG */
#define SD24BIV_SD24IFG0     (0x0006u)    /* SD24IFG0 */

/* SD24BCCTLx */
#define SD24DF0              (0x0010u)  /* SD24B Data Format Bit: 0 */
#define SD24DF1              (0x0020u)  /* SD24B Data Format Bit: 1 */
#define SD24ALGN             (0x0040u)  /* SD24B Data Alignment */
#define SD24CAL              (0x0200u)  /* SD24B Calibration */
#define SD24DFS0             (0x0400u)  /* SD24B Digital Filter Bit: 0 */
#define SD24DFS1             (0x0800u)  /* SD24B Digital Filter Bit: 1 */
#define SD24DI               (0x1000u)  /* SD24B Digital Bitstream Input */
#define SD24MC0              (0x2000u)  /* SD24B Manchaster Encoding Bit: 0 */
#define SD24MC1              (0x4000u)  /* SD24B Manchaster Encoding Bit: 1 */

#define SD24DF0_L           (0x0010u)  /* SD24B Data Format Bit: 0 */
#define SD24DF1_L           (0x0020u)  /* SD24B Data Format Bit: 1 */
#define SD24ALGN_L          (0x0040u)  /* SD24B Data Alignment */

#define SD24CAL_H           (0x0002u)  /* SD24B Calibration */
#define SD24DFS0_H          (0x0004u)  /* SD24B Digital Filter Bit: 0 */
#define SD24DFS1_H          (0x0008u)  /* SD24B Digital Filter Bit: 1 */
#define SD24DI_H            (0x0010u)  /* SD24B Digital Bitstream Input */
#define SD24MC0_H           (0x0020u)  /* SD24B Manchaster Encoding Bit: 0 */
#define SD24MC1_H           (0x0040u)  /* SD24B Manchaster Encoding Bit: 1 */

#define SD24DF_0             (0x0000u)  /* SD24B Data Format: Offset Binary  */
#define SD24DF_1             (0x0010u)  /* SD24B Data Format: 2's complement */

#define SD24DFS_0            (0x0000u)  /* SD24B Digital Filter 0 */
#define SD24DFS_1            (0x0400u)  /* SD24B Digital Filter 1 */
#define SD24DFS_2            (0x0800u)  /* SD24B Digital Filter 2 */
#define SD24DFS_3            (0x0C00u)  /* SD24B Digital Filter 3 */

#define SD24MC_0             (0x0000u)  /* SD24B Manchaster Encoding 0 */
#define SD24MC_1             (0x2000u)  /* SD24B Manchaster Encoding 1 */
#define SD24MC_2             (0x4000u)  /* SD24B Manchaster Encoding 2 */
#define SD24MC_3             (0x6000u)  /* SD24B Manchaster Encoding 3 */

/* SD24BINCTLx */
#define SD24GAIN0           (0x0008u)  /* SD24B Input Pre-Amplifier Gain Select 0 */
#define SD24GAIN1           (0x0010u)  /* SD24B Input Pre-Amplifier Gain Select 1 */
#define SD24GAIN2           (0x0020u)  /* SD24B Input Pre-Amplifier Gain Select 2 */
#define SD24INTDLY0         (0x0040u)  /* SD24B Interrupt Delay after 1.Conversion 0 */
#define SD24INTDLY1         (0x0080u)  /* SD24B Interrupt Delay after 1.Conversion 1 */

#define SD24GAIN0_L         (0x0008u)  /* SD24B Input Pre-Amplifier Gain Select 0 */
#define SD24GAIN1_L         (0x0010u)  /* SD24B Input Pre-Amplifier Gain Select 1 */
#define SD24GAIN2_L         (0x0020u)  /* SD24B Input Pre-Amplifier Gain Select 2 */
#define SD24INTDLY0_L       (0x0040u)  /* SD24B Interrupt Delay after 1.Conversion 0 */
#define SD24INTDLY1_L       (0x0080u)  /* SD24B Interrupt Delay after 1.Conversion 1 */

#define SD24GAIN_1          (0x0000u)  /* SD24B Input Pre-Amplifier Gain Select *1  */
#define SD24GAIN_2          (0x0008u)  /* SD24B Input Pre-Amplifier Gain Select *2  */
#define SD24GAIN_4          (0x0010u)  /* SD24B Input Pre-Amplifier Gain Select *4  */
#define SD24GAIN_8          (0x0018u)  /* SD24B Input Pre-Amplifier Gain Select *8  */
#define SD24GAIN_16         (0x0020u)  /* SD24B Input Pre-Amplifier Gain Select *16 */
#define SD24GAIN_32         (0x0028u)  /* SD24B Input Pre-Amplifier Gain Select *32 */
#define SD24GAIN_64         (0x0030u)  /* SD24B Input Pre-Amplifier Gain Select *64 */
#define SD24GAIN_128        (0x0038u)  /* SD24B Input Pre-Amplifier Gain Select *128 */

#define SD24INTDLY_0        (0x0000u)  /* SD24B Interrupt Delay: Int. after 4.Conversion  */
#define SD24INTDLY_1        (0x0040u)  /* SD24B Interrupt Delay: Int. after 3.Conversion  */
#define SD24INTDLY_2        (0x0080u)  /* SD24B Interrupt Delay: Int. after 2.Conversion  */
#define SD24INTDLY_3        (0x00C0u)  /* SD24B Interrupt Delay: Int. after 1.Conversion  */

/* SD24BOSRx */
#define OSR0               (0x0001u)  /* SD24B Oversampling Rate Bit: 0 */
#define OSR1               (0x0002u)  /* SD24B Oversampling Rate Bit: 1 */
#define OSR2               (0x0004u)  /* SD24B Oversampling Rate Bit: 2 */
#define OSR3               (0x0008u)  /* SD24B Oversampling Rate Bit: 3 */
#define OSR4               (0x0010u)  /* SD24B Oversampling Rate Bit: 4 */
#define OSR5               (0x0020u)  /* SD24B Oversampling Rate Bit: 5 */
#define OSR6               (0x0040u)  /* SD24B Oversampling Rate Bit: 6 */
#define OSR7               (0x0080u)  /* SD24B Oversampling Rate Bit: 7 */
#define OSR8               (0x0100u)  /* SD24B Oversampling Rate Bit: 8 */
#define OSR9               (0x0200u)  /* SD24B Oversampling Rate Bit: 9 */
#define OSR10               (0x0400u)  /* SD24B Oversampling Rate Bit: 10 */

#define OSR0_L              (0x0001u)  /* SD24B Oversampling Rate Bit: 0 */
#define OSR1_L              (0x0002u)  /* SD24B Oversampling Rate Bit: 1 */
#define OSR2_L              (0x0004u)  /* SD24B Oversampling Rate Bit: 2 */
#define OSR3_L              (0x0008u)  /* SD24B Oversampling Rate Bit: 3 */
#define OSR4_L              (0x0010u)  /* SD24B Oversampling Rate Bit: 4 */
#define OSR5_L              (0x0020u)  /* SD24B Oversampling Rate Bit: 5 */
#define OSR6_L              (0x0040u)  /* SD24B Oversampling Rate Bit: 6 */
#define OSR7_L              (0x0080u)  /* SD24B Oversampling Rate Bit: 7 */

#define OSR8_H              (0x0001u)  /* SD24B Oversampling Rate Bit: 8 */
#define OSR9_H              (0x0002u)  /* SD24B Oversampling Rate Bit: 9 */
#define OSR10_H             (0x0004u)  /* SD24B Oversampling Rate Bit: 10 */

/* SD24BTRGOSR */

