arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430f5xx_6xxgeneric.h
/* TDxHCTL0 Control Bits */
#define TDHEN               (0x0001u)   /* Timer_D7 High-Resolution Enable */
#define TDHREGEN            (0x0002u)   /* Timer_D7 High-Resolution Regulatied Mode */
#define TDHEAEN             (0x0004u)   /* Timer_D7 High-Resolution clock error accum. enable */
#define TDHRON              (0x0008u)   /* Timer_D7 High-Resolution Generator forced on*/
#define TDHM0               (0x0010u)   /* Timer_D7 High-Resoltuion Clock Mult. Bit: 0 */
#define TDHM1               (0x0020u)   /* Timer_D7 High-Resoltuion Clock Mult. Bit: 1 */
#define TDHD0               (0x0040u)   /* Timer_D7 High-Resolution clock divider Bit: 0 */
#define TDHD1               (0x0080u)   /* Timer_D7 High-Resolution clock divider Bit: 1 */
#define TDHFW               (0x0100u)   /* Timer_D7 High-resolution generator fast wakeup enable */

#define TDHCALEN            TDHREGEN   /* Timer_D7 Lagacy Definition */

#define TDHM_0              (0x0000u)   /* Timer_D7 High-Resoltuion Clock Mult.: 8x TimerD clock */
#define TDHM_1              (0x0010u)   /* Timer_D7 High-Resoltuion Clock Mult.: 16x TimerD clock */
#define TDHM__8             (0x0000u)   /* Timer_D7 High-Resoltuion Clock Mult.: 8x TimerD clock */
#define TDHM__16            (0x0010u)   /* Timer_D7 High-Resoltuion Clock Mult.: 16x TimerD clock */
#define TDHD_0              (0x0000u)   /* Timer_D7 High-Resolution clock divider: /1 */
#define TDHD_1              (0x0040u)   /* Timer_D7 High-Resolution clock divider: /2 */
#define TDHD_2              (0x0080u)   /* Timer_D7 High-Resolution clock divider: /4 */
#define TDHD_3              (0x00C0u)   /* Timer_D7 High-Resolution clock divider: /8 */
#define TDHD__1             (0x0000u)   /* Timer_D7 High-Resolution clock divider: /1 */
#define TDHD__2             (0x0040u)   /* Timer_D7 High-Resolution clock divider: /2 */
#define TDHD__4             (0x0080u)   /* Timer_D7 High-Resolution clock divider: /4 */
#define TDHD__8             (0x00C0u)   /* Timer_D7 High-Resolution clock divider: /8 */

/* TDxHCTL1 Control Bits */
#define TDHCLKTRIM0         (0x0002u)   /* Timer_D7 High-Resolution Clock Trim Bit: 0 */
#define TDHCLKTRIM1         (0x0004u)   /* Timer_D7 High-Resolution Clock Trim Bit: 1 */
#define TDHCLKTRIM2         (0x0008u)   /* Timer_D7 High-Resolution Clock Trim Bit: 2 */
#define TDHCLKTRIM3         (0x0010u)   /* Timer_D7 High-Resolution Clock Trim Bit: 3 */
#define TDHCLKTRIM4         (0x0020u)   /* Timer_D7 High-Resolution Clock Trim Bit: 4 */
#define TDHCLKTRIM5         (0x0040u)   /* Timer_D7 High-Resolution Clock Trim Bit: 5 */
#define TDHCLKTRIM6         (0x0080u)   /* Timer_D7 High-Resolution Clock Trim Bit: 6 */
#define TDHCLKSR0           (0x0100u)   /* Timer_D7 High-Resolution Clock Sub-Range Bit: 0 */
#define TDHCLKSR1           (0x0200u)   /* Timer_D7 High-Resolution Clock Sub-Range Bit: 1 */
#define TDHCLKSR2           (0x0400u)   /* Timer_D7 High-Resolution Clock Sub-Range Bit: 2 */
#define TDHCLKSR3           (0x0800u)   /* Timer_D7 High-Resolution Clock Sub-Range Bit: 3 */
#define TDHCLKSR4           (0x1000u)   /* Timer_D7 High-Resolution Clock Sub-Range Bit: 4 */
#define TDHCLKR0            (0x2000u)   /* Timer_D7 High-Resolution Clock Range Bit: 0 */
#define TDHCLKR1            (0x4000u)   /* Timer_D7 High-Resolution Clock Range Bit: 1 */
#define TDHCLKCR            (0x8000u)   /* Timer_D7 High-Resolution Coarse Clock Range */

/* TDxHINT Control Bits */
#define TDHFLIFG            (0x0001u)   /* Timer_D7 High-Res. fail low Interrupt Flag */
#define TDHFHIFG            (0x0002u)   /* Timer_D7 High-Res. fail high Interrupt Flag */
#define TDHLKIFG            (0x0004u)   /* Timer_D7 High-Res. frequency lock Interrupt Flag */
#define TDHUNLKIFG          (0x0008u)   /* Timer_D7 High-Res. frequency unlock Interrupt Flag */
#define TDHFLIE             (0x0100u)   /* Timer_D7 High-Res. fail low Interrupt Enable */
#define TDHFHIE             (0x0200u)   /* Timer_D7 High-Res. fail high Interrupt Enable */
#define TDHLKIE             (0x0400u)   /* Timer_D7 High-Res. frequency lock Interrupt Enable */
#define TDHUNLKIE           (0x0800u)   /* Timer_D7 High-Res. frequency unlock Interrupt Enable */

#define ID1                    (0x0080u)       /* Timer D clock input divider 1 */
#define ID0                    (0x0040u)       /* Timer D clock input divider 0 */
#define MC1                    (0x0020u)       /* Timer D mode control 1 */
#define MC0                    (0x0010u)       /* Timer D mode control 0 */
#define MC__STOP               (0*0x10u)      /* Timer D mode control: 0 - Stop */
#define MC__UP                 (1*0x10u)      /* Timer D mode control: 1 - Up to CCR0 */
#define MC__CONTINUOUS         (2*0x10u)      /* Timer D mode control: 2 - Continuous up */
#define MC__CONTINOUS          (2*0x10u)      /* Legacy define */
#define MC__UPDOWN             (3*0x10u)      /* Timer D mode control: 3 - Up/Down */
#define CM1                    (0x8000u)       /* Capture mode 1 */
#define CM0                    (0x4000u)       /* Capture mode 0 */
#define MC_0                   (0*0x10u)      /* Timer D mode control: 0 - Stop */
#define MC_1                   (1*0x10u)      /* Timer D mode control: 1 - Up to CCR0 */
#define MC_2                   (2*0x10u)      /* Timer D mode control: 2 - Continuous up */
#define MC_3                   (3*0x10u)      /* Timer D mode control: 3 - Up/Down */
#define CAP                    (0x0100u)       /* Capture mode: 1 /Compare mode : 0 */
#define CCIE                   (0x0010u)       /* Capture/compare interrupt enable */
#define CCIFG                  (0x0001u)       /* Capture/compare interrupt flag */
#define CCIS_0                 (0*0x1000u)
#define CCIS_1                 (1*0x1000u)
#define CCIS_2                 (2*0x1000u)
#define CCIS_3                 (3*0x1000u)
#define CM_0                   (0*0x4000u)    /* Capture mode: 0 - disabled */
#define CM_1                   (1*0x4000u)    /* Capture mode: 1 - pos. edge */
#define CM_2                   (2*0x4000u)    /* Capture mode: 1 - neg. edge */
#define CM_3                   (3*0x4000u)    /* Capture mode: 1 - both edges */
#define OUT                    (0x0004u)       /* PWM Output signal if output mode 0 */
#define OUTMOD_0               (0*0x20u)      /* PWM output mode: 0 - output only */
#define OUTMOD_1               (1*0x20u)      /* PWM output mode: 1 - set */
#define OUTMOD_2               (2*0x20u)      /* PWM output mode: 2 - PWM toggle/reset */
#define OUTMOD_3               (3*0x20u)      /* PWM output mode: 3 - PWM set/reset */
#define OUTMOD_4               (4*0x20u)      /* PWM output mode: 4 - toggle */
#define OUTMOD_5               (5*0x20u)      /* PWM output mode: 5 - Reset */
#define OUTMOD_6               (6*0x20u)      /* PWM output mode: 6 - PWM toggle/set */
#define OUTMOD_7               (7*0x20u)      /* PWM output mode: 7 - PWM reset/set */
#define SCCI                   (0x0400u)       /* Latched capture signal (read) */
#define SCS                    (0x0800u)       /* Capture sychronize */
#define CCI                    (0x0008u)       /* Capture input signal (read) */
#define ID__1                  (0*0x40u)      /* Timer D input divider: 0 - /1 */
#define ID__2                  (1*0x40u)      /* Timer D input divider: 1 - /2 */
#define ID__4                  (2*0x40u)      /* Timer D input divider: 2 - /4 */
#define ID__8                  (3*0x40u)      /* Timer D input divider: 3 - /8 */
#define ID_0                   (0*0x40u)      /* Timer D input divider: 0 - /1 */
#define ID_1                   (1*0x40u)      /* Timer D input divider: 1 - /2 */
#define ID_2                   (2*0x40u)      /* Timer D input divider: 2 - /4 */
#define ID_3                   (3*0x40u)      /* Timer D input divider: 3 - /8 */

#endif
/************************************************************
* Timer Event Control 0
************************************************************/
#ifdef  __MSP430_HAS_TEV0__             /* Definition to show that Module is available */

#define OFS_TEC0XCTL0         (0x0000u)  /* Timer Event Control 0 External Control 0 */
#define OFS_TEC0XCTL0_L        OFS_TEC0XCTL0
#define OFS_TEC0XCTL0_H        OFS_TEC0XCTL0+1
#define OFS_TEC0XCTL1         (0x0002u)  /* Timer Event Control 0 External Control 1 */
#define OFS_TEC0XCTL1_L        OFS_TEC0XCTL1
#define OFS_TEC0XCTL1_H        OFS_TEC0XCTL1+1
#define OFS_TEC0XCTL2         (0x0004u)  /* Timer Event Control 0 External Control 2 */
#define OFS_TEC0XCTL2_L        OFS_TEC0XCTL2
#define OFS_TEC0XCTL2_H        OFS_TEC0XCTL2+1
#define OFS_TEC0STA           (0x0006u)  /* Timer Event Control 0 Status */
#define OFS_TEC0STA_L          OFS_TEC0STA
#define OFS_TEC0STA_H          OFS_TEC0STA+1
#define OFS_TEC0XINT          (0x0008u)  /* Timer Event Control 0 External Interrupt */
#define OFS_TEC0XINT_L         OFS_TEC0XINT
#define OFS_TEC0XINT_H         OFS_TEC0XINT+1
#define OFS_TEC0IV            (0x000Au)  /* Timer Event Control 0 Interrupt Vector */
#define OFS_TEC0IV_L           OFS_TEC0IV
#define OFS_TEC0IV_H           OFS_TEC0IV+1

/* TECxXCTL0 Control Bits */
#define TECXFLTHLD0         (0x0001u)  /* TEV Ext. fault signal hold for CE0 */
#define TECXFLTHLD1         (0x0002u)  /* TEV Ext. fault signal hold for CE1 */
#define TECXFLTHLD2         (0x0004u)  /* TEV Ext. fault signal hold for CE2 */
#define TECXFLTHLD3         (0x0008u)  /* TEV Ext. fault signal hold for CE3 */
#define TECXFLTHLD4         (0x0010u)  /* TEV Ext. fault signal hold for CE4 */
#define TECXFLTHLD5         (0x0020u)  /* TEV Ext. fault signal hold for CE5 */
#define TECXFLTHLD6         (0x0040u)  /* TEV Ext. fault signal hold for CE6 */
#define TECXFLTEN0          (0x0100u)  /* TEV Ext. fault signal enable for CE0 */
#define TECXFLTEN1          (0x0200u)  /* TEV Ext. fault signal enable for CE1 */
#define TECXFLTEN2          (0x0400u)  /* TEV Ext. fault signal enable for CE2 */
#define TECXFLTEN3          (0x0800u)  /* TEV Ext. fault signal enable for CE3 */
#define TECXFLTEN4          (0x1000u)  /* TEV Ext. fault signal enable for CE4 */
#define TECXFLTEN5          (0x2000u)  /* TEV Ext. fault signal enable for CE5 */
#define TECXFLTEN6          (0x4000u)  /* TEV Ext. fault signal enable for CE6 */

/* TECxXCTL0 Control Bits */
#define TECXFLTHLD0_L       (0x0001u)  /* TEV Ext. fault signal hold for CE0 */
#define TECXFLTHLD1_L       (0x0002u)  /* TEV Ext. fault signal hold for CE1 */
#define TECXFLTHLD2_L       (0x0004u)  /* TEV Ext. fault signal hold for CE2 */
#define TECXFLTHLD3_L       (0x0008u)  /* TEV Ext. fault signal hold for CE3 */
#define TECXFLTHLD4_L       (0x0010u)  /* TEV Ext. fault signal hold for CE4 */
#define TECXFLTHLD5_L       (0x0020u)  /* TEV Ext. fault signal hold for CE5 */
#define TECXFLTHLD6_L       (0x0040u)  /* TEV Ext. fault signal hold for CE6 */

/* TECxXCTL0 Control Bits */
#define TECXFLTEN0_H        (0x0001u)  /* TEV Ext. fault signal enable for CE0 */
#define TECXFLTEN1_H        (0x0002u)  /* TEV Ext. fault signal enable for CE1 */
#define TECXFLTEN2_H        (0x0004u)  /* TEV Ext. fault signal enable for CE2 */
#define TECXFLTEN3_H        (0x0008u)  /* TEV Ext. fault signal enable for CE3 */
#define TECXFLTEN4_H        (0x0010u)  /* TEV Ext. fault signal enable for CE4 */
#define TECXFLTEN5_H        (0x0020u)  /* TEV Ext. fault signal enable for CE5 */
#define TECXFLTEN6_H        (0x0040u)  /* TEV Ext. fault signal enable for CE6 */

/* TECxXCTL1 Control Bits */
#define TECXFLTPOL0         (0x0001u)  /* TEV Polarity Bit of ext. fault 0 */
#define TECXFLTPOL1         (0x0002u)  /* TEV Polarity Bit of ext. fault 1 */
#define TECXFLTPOL2         (0x0004u)  /* TEV Polarity Bit of ext. fault 2 */
#define TECXFLTPOL3         (0x0008u)  /* TEV Polarity Bit of ext. fault 3 */
#define TECXFLTPOL4         (0x0010u)  /* TEV Polarity Bit of ext. fault 4 */
#define TECXFLTPOL5         (0x0020u)  /* TEV Polarity Bit of ext. fault 5 */
#define TECXFLTPOL6         (0x0040u)  /* TEV Polarity Bit of ext. fault 6 */
#define TECXFLTLVS0         (0x0100u)  /* TEV Signal Type of Ext. fault 0 */
#define TECXFLTLVS1         (0x0200u)  /* TEV Signal Type of Ext. fault 1 */
#define TECXFLTLVS2         (0x0400u)  /* TEV Signal Type of Ext. fault 2 */
#define TECXFLTLVS3         (0x0800u)  /* TEV Signal Type of Ext. fault 3 */
#define TECXFLTLVS4         (0x1000u)  /* TEV Signal Type of Ext. fault 4 */
#define TECXFLTLVS5         (0x2000u)  /* TEV Signal Type of Ext. fault 5 */
#define TECXFLTLVS6         (0x4000u)  /* TEV Signal Type of Ext. fault 6 */

/* TECxXCTL1 Control Bits */
#define TECXFLTPOL0_L       (0x0001u)  /* TEV Polarity Bit of ext. fault 0 */
#define TECXFLTPOL1_L       (0x0002u)  /* TEV Polarity Bit of ext. fault 1 */
#define TECXFLTPOL2_L       (0x0004u)  /* TEV Polarity Bit of ext. fault 2 */
#define TECXFLTPOL3_L       (0x0008u)  /* TEV Polarity Bit of ext. fault 3 */
#define TECXFLTPOL4_L       (0x0010u)  /* TEV Polarity Bit of ext. fault 4 */
#define TECXFLTPOL5_L       (0x0020u)  /* TEV Polarity Bit of ext. fault 5 */
#define TECXFLTPOL6_L       (0x0040u)  /* TEV Polarity Bit of ext. fault 6 */

/* TECxXCTL1 Control Bits */
#define TECXFLTLVS0_H       (0x0001u)  /* TEV Signal Type of Ext. fault 0 */
#define TECXFLTLVS1_H       (0x0002u)  /* TEV Signal Type of Ext. fault 1 */
#define TECXFLTLVS2_H       (0x0004u)  /* TEV Signal Type of Ext. fault 2 */
#define TECXFLTLVS3_H       (0x0008u)  /* TEV Signal Type of Ext. fault 3 */
#define TECXFLTLVS4_H       (0x0010u)  /* TEV Signal Type of Ext. fault 4 */
#define TECXFLTLVS5_H       (0x0020u)  /* TEV Signal Type of Ext. fault 5 */
#define TECXFLTLVS6_H       (0x0040u)  /* TEV Signal Type of Ext. fault 6 */

/* TECxXCTL2 Control Bits */
#define TECCLKSEL0          (0x0001u)  /* TEV Aux. Clock Select Bit: 0 */
#define TECCLKSEL1          (0x0002u)  /* TEV Aux. Clock Select Bit: 1 */
#define TECAXCLREN          (0x0004u)  /* TEV Auxilary clear signal control */
#define TECEXCLREN          (0x0008u)  /* TEV Ext. clear signal control */
#define TECEXCLRHLD         (0x0010u)  /* TEV External clear signal hold bit */
#define TECEXCLRPOL         (0x0020u)  /* TEV Polarity Bit of ext. clear */
#define TECEXCLRLVS         (0x0040u)  /* TEV Signal Type of Ext. clear */

/* TECxXCTL2 Control Bits */
#define TECCLKSEL0_L        (0x0001u)  /* TEV Aux. Clock Select Bit: 0 */
#define TECCLKSEL1_L        (0x0002u)  /* TEV Aux. Clock Select Bit: 1 */
#define TECAXCLREN_L        (0x0004u)  /* TEV Auxilary clear signal control */
#define TECEXCLREN_L        (0x0008u)  /* TEV Ext. clear signal control */
#define TECEXCLRHLD_L       (0x0010u)  /* TEV External clear signal hold bit */
#define TECEXCLRPOL_L       (0x0020u)  /* TEV Polarity Bit of ext. clear */
#define TECEXCLRLVS_L       (0x0040u)  /* TEV Signal Type of Ext. clear */

#define TECCLKSEL_0         (0x0000u)  /* TEV Aux. Clock Select: CLK0 */
#define TECCLKSEL_1         (0x0001u)  /* TEV Aux. Clock Select: CLK1 */
#define TECCLKSEL_2         (0x0002u)  /* TEV Aux. Clock Select: CLK2 */
#define TECCLKSEL_3         (0x0003u)  /* TEV Aux. Clock Select: CLK3 */

/* TECxSTA Control Bits */
#define TECXFLT0STA         (0x0001u)  /* TEV External fault status flag for CE0 */
#define TECXFLT1STA         (0x0002u)  /* TEV External fault status flag for CE1 */
#define TECXFLT2STA         (0x0004u)  /* TEV External fault status flag for CE2 */
#define TECXFLT3STA         (0x0008u)  /* TEV External fault status flag for CE3 */
#define TECXFLT4STA         (0x0010u)  /* TEV External fault status flag for CE4 */
#define TECXFLT5STA         (0x0020u)  /* TEV External fault status flag for CE5 */
#define TECXFLT6STA         (0x0040u)  /* TEV External fault status flag for CE6 */
#define TECXCLRSTA          (0x0100u)  /* TEC External clear status flag */

/* TECxSTA Control Bits */
#define TECXFLT0STA_L       (0x0001u)  /* TEV External fault status flag for CE0 */
#define TECXFLT1STA_L       (0x0002u)  /* TEV External fault status flag for CE1 */
#define TECXFLT2STA_L       (0x0004u)  /* TEV External fault status flag for CE2 */
#define TECXFLT3STA_L       (0x0008u)  /* TEV External fault status flag for CE3 */
#define TECXFLT4STA_L       (0x0010u)  /* TEV External fault status flag for CE4 */
#define TECXFLT5STA_L       (0x0020u)  /* TEV External fault status flag for CE5 */
#define TECXFLT6STA_L       (0x0040u)  /* TEV External fault status flag for CE6 */

/* TECxSTA Control Bits */
#define TECXCLRSTA_H        (0x0001u)  /* TEC External clear status flag */

