arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430f5xx_6xxgeneric.h
#define XCAP_0              (0x0000u)    /* XIN/XOUT Cap 0 */
#define XCAP_1              (0x0004u)    /* XIN/XOUT Cap 1 */
#define XCAP_2              (0x0008u)    /* XIN/XOUT Cap 2 */
#define XCAP_3              (0x000Cu)    /* XIN/XOUT Cap 3 */
#define XT1DRIVE_0          (0x0000u)    /* XT1 Drive Level mode: 0 */
#define XT1DRIVE_1          (0x0040u)    /* XT1 Drive Level mode: 1 */
#define XT1DRIVE_2          (0x0080u)    /* XT1 Drive Level mode: 2 */
#define XT1DRIVE_3          (0x00C0u)    /* XT1 Drive Level mode: 3 */

/* UCSCTL7 Control Bits */
#define DCOFFG              (0x0001u)    /* DCO Fault Flag */
#define XT1LFOFFG           (0x0002u)    /* XT1 Low Frequency Oscillator Fault Flag */
#define XT1HFOFFG           (0x0004u)    /* XT1 High Frequency Oscillator 1 Fault Flag */
#define XT2OFFG             (0x0008u)    /* High Frequency Oscillator 2 Fault Flag */
//#define RESERVED            (0x0010u)    /* RESERVED */
//#define RESERVED            (0x0020u)    /* RESERVED */
//#define RESERVED            (0x0040u)    /* RESERVED */
//#define RESERVED            (0x0080u)    /* RESERVED */
//#define RESERVED            (0x0100u)    /* RESERVED */
//#define RESERVED            (0x0200u)    /* RESERVED */
//#define RESERVED            (0x0400u)    /* RESERVED */
//#define RESERVED            (0x0800u)    /* RESERVED */
//#define RESERVED            (0x1000u)    /* RESERVED */
//#define RESERVED            (0x2000u)    /* RESERVED */
//#define RESERVED            (0x4000u)    /* RESERVED */
//#define RESERVED            (0x8000u)    /* RESERVED */

/* UCSCTL7 Control Bits */
#define DCOFFG_L            (0x0001u)    /* DCO Fault Flag */
#define XT1LFOFFG_L         (0x0002u)    /* XT1 Low Frequency Oscillator Fault Flag */
#define XT1HFOFFG_L         (0x0004u)    /* XT1 High Frequency Oscillator 1 Fault Flag */
#define XT2OFFG_L           (0x0008u)    /* High Frequency Oscillator 2 Fault Flag */
//#define RESERVED            (0x0010u)    /* RESERVED */
//#define RESERVED            (0x0020u)    /* RESERVED */
//#define RESERVED            (0x0040u)    /* RESERVED */
//#define RESERVED            (0x0080u)    /* RESERVED */
//#define RESERVED            (0x0100u)    /* RESERVED */
//#define RESERVED            (0x0200u)    /* RESERVED */
//#define RESERVED            (0x0400u)    /* RESERVED */
//#define RESERVED            (0x0800u)    /* RESERVED */
//#define RESERVED            (0x1000u)    /* RESERVED */
//#define RESERVED            (0x2000u)    /* RESERVED */
//#define RESERVED            (0x4000u)    /* RESERVED */
//#define RESERVED            (0x8000u)    /* RESERVED */

/* UCSCTL8 Control Bits */
#define ACLKREQEN           (0x0001u)    /* ACLK Clock Request Enable */
#define MCLKREQEN           (0x0002u)    /* MCLK Clock Request Enable */
#define SMCLKREQEN          (0x0004u)    /* SMCLK Clock Request Enable */
#define MODOSCREQEN         (0x0008u)    /* MODOSC Clock Request Enable */
//#define RESERVED            (0x0010u)    /* RESERVED */
//#define RESERVED            (0x0020u)    /* RESERVED */
//#define RESERVED            (0x0040u)    /* RESERVED */
//#define RESERVED            (0x0080u)    /* RESERVED */
//#define RESERVED            (0x0100u)    /* RESERVED */
//#define RESERVED            (0x0200u)    /* RESERVED */
//#define RESERVED            (0x0400u)    /* RESERVED */
//#define RESERVED            (0x0800u)    /* RESERVED */
//#define RESERVED            (0x1000u)    /* RESERVED */
//#define RESERVED            (0x2000u)    /* RESERVED */
//#define RESERVED            (0x4000u)    /* RESERVED */
//#define RESERVED            (0x8000u)    /* RESERVED */

/* UCSCTL8 Control Bits */
#define ACLKREQEN_L         (0x0001u)    /* ACLK Clock Request Enable */
#define MCLKREQEN_L         (0x0002u)    /* MCLK Clock Request Enable */
#define SMCLKREQEN_L        (0x0004u)    /* SMCLK Clock Request Enable */
#define MODOSCREQEN_L       (0x0008u)    /* MODOSC Clock Request Enable */
//#define RESERVED            (0x0010u)    /* RESERVED */
//#define RESERVED            (0x0020u)    /* RESERVED */
//#define RESERVED            (0x0040u)    /* RESERVED */
//#define RESERVED            (0x0080u)    /* RESERVED */
//#define RESERVED            (0x0100u)    /* RESERVED */
//#define RESERVED            (0x0200u)    /* RESERVED */
//#define RESERVED            (0x0400u)    /* RESERVED */
//#define RESERVED            (0x0800u)    /* RESERVED */
//#define RESERVED            (0x1000u)    /* RESERVED */
//#define RESERVED            (0x2000u)    /* RESERVED */
//#define RESERVED            (0x4000u)    /* RESERVED */
//#define RESERVED            (0x8000u)    /* RESERVED */

#endif
/************************************************************
* USB
************************************************************/
#ifdef  __MSP430_HAS_USB__            /* Definition to show that Module is available */

/* ========================================================================= */
/* USB Configuration Registers */
/* ========================================================================= */
#define OFS_USBKEYID          (0x0000u)    /* USB Controller key register */
#define OFS_USBKEYID_L         OFS_USBKEYID
#define OFS_USBKEYID_H         OFS_USBKEYID+1
#define OFS_USBCNF            (0x0002u)    /* USB Module  configuration register */
#define OFS_USBCNF_L           OFS_USBCNF
#define OFS_USBCNF_H           OFS_USBCNF+1
#define OFS_USBPHYCTL         (0x0004u)    /* USB PHY control register */
#define OFS_USBPHYCTL_L        OFS_USBPHYCTL
#define OFS_USBPHYCTL_H        OFS_USBPHYCTL+1
#define OFS_USBPWRCTL         (0x0008u)    /* USB Power control register */
#define OFS_USBPWRCTL_L        OFS_USBPWRCTL
#define OFS_USBPWRCTL_H        OFS_USBPWRCTL+1
#define OFS_USBPLLCTL         (0x0010u)    /* USB PLL control register */
#define OFS_USBPLLCTL_L        OFS_USBPLLCTL
#define OFS_USBPLLCTL_H        OFS_USBPLLCTL+1
#define OFS_USBPLLDIVB        (0x0012u)    /* USB PLL Clock Divider Buffer control register */
#define OFS_USBPLLDIVB_L       OFS_USBPLLDIVB
#define OFS_USBPLLDIVB_H       OFS_USBPLLDIVB+1
#define OFS_USBPLLIR          (0x0014u)    /* USB PLL Interrupt control register */
#define OFS_USBPLLIR_L         OFS_USBPLLIR
#define OFS_USBPLLIR_H         OFS_USBPLLIR+1

#define USBKEYPID      USBKEYID    /* Legacy Definition: USB Controller key register */
#define USBKEY         (0x9628u)    /* USB Control Register key */

/* USBCNF Control Bits */
#define USB_EN              (0x0001u)  /* USB - Module enable */
#define PUR_EN              (0x0002u)  /* USB - PUR pin enable */
#define PUR_IN              (0x0004u)  /* USB - PUR pin input value */
#define BLKRDY              (0x0008u)  /* USB - Block ready signal for DMA */
#define FNTEN               (0x0010u)  /* USB - Frame Number receive Trigger enable for DMA */
//#define RESERVED            (0x0020u)  /* USB -  */
//#define RESERVED            (0x0040u)  /* USB -  */
//#define RESERVED            (0x0080u)  /* USB -  */
//#define RESERVED            (0x0100u)  /* USB -  */
//#define RESERVED            (0x0200u)  /* USB -  */
//#define RESERVED            (0x0400u)  /* USB -  */
//#define RESERVED            (0x0800u)  /* USB -  */
//#define RESERVED            (0x1000u)  /* USB -  */
//#define RESERVED            (0x2000u)  /* USB -  */
//#define RESERVED            (0x4000u)  /* USB -  */
//#define RESERVED            (0x8000u)  /* USB -  */

/* USBCNF Control Bits */
#define USB_EN_L            (0x0001u)  /* USB - Module enable */
#define PUR_EN_L            (0x0002u)  /* USB - PUR pin enable */
#define PUR_IN_L            (0x0004u)  /* USB - PUR pin input value */
#define BLKRDY_L            (0x0008u)  /* USB - Block ready signal for DMA */
#define FNTEN_L             (0x0010u)  /* USB - Frame Number receive Trigger enable for DMA */
//#define RESERVED            (0x0020u)  /* USB -  */
//#define RESERVED            (0x0040u)  /* USB -  */
//#define RESERVED            (0x0080u)  /* USB -  */
//#define RESERVED            (0x0100u)  /* USB -  */
//#define RESERVED            (0x0200u)  /* USB -  */
//#define RESERVED            (0x0400u)  /* USB -  */
//#define RESERVED            (0x0800u)  /* USB -  */
//#define RESERVED            (0x1000u)  /* USB -  */
//#define RESERVED            (0x2000u)  /* USB -  */
//#define RESERVED            (0x4000u)  /* USB -  */
//#define RESERVED            (0x8000u)  /* USB -  */

/* USBPHYCTL Control Bits */
#define PUOUT0              (0x0001u)  /* USB - USB Port Output Signal Bit 0 */
#define PUOUT1              (0x0002u)  /* USB - USB Port Output Signal Bit 1 */
#define PUIN0               (0x0004u)  /* USB - PU0/DP Input Data */
#define PUIN1               (0x0008u)  /* USB - PU1/DM Input Data */
//#define RESERVED            (0x0010u)  /* USB -  */
#define PUOPE               (0x0020u)  /* USB - USB Port Output Enable */
//#define RESERVED            (0x0040u)  /* USB -  */
#define PUSEL               (0x0080u)  /* USB - USB Port Function Select */
#define PUIPE               (0x0100u)  /* USB - PHY Single Ended Input enable */
//#define RESERVED            (0x0200u)  /* USB -  */
//#define RESERVED            (0x0100u)  /* USB -  */
//#define RESERVED            (0x0200u)  /* USB -  */
//#define RESERVED            (0x0400u)  /* USB -  */
//#define RESERVED            (0x0800u)  /* USB -  */
//#define RESERVED            (0x1000u)  /* USB -  */
//#define RESERVED            (0x2000u)  /* USB -  */
//#define RESERVED            (0x4000u)  /* USB -  */
//#define RESERVED            (0x8000u)  /* USB -  */

/* USBPHYCTL Control Bits */
#define PUOUT0_L            (0x0001u)  /* USB - USB Port Output Signal Bit 0 */
#define PUOUT1_L            (0x0002u)  /* USB - USB Port Output Signal Bit 1 */
#define PUIN0_L             (0x0004u)  /* USB - PU0/DP Input Data */
#define PUIN1_L             (0x0008u)  /* USB - PU1/DM Input Data */
//#define RESERVED            (0x0010u)  /* USB -  */
#define PUOPE_L             (0x0020u)  /* USB - USB Port Output Enable */
//#define RESERVED            (0x0040u)  /* USB -  */
#define PUSEL_L             (0x0080u)  /* USB - USB Port Function Select */
//#define RESERVED            (0x0200u)  /* USB -  */
//#define RESERVED            (0x0100u)  /* USB -  */
//#define RESERVED            (0x0200u)  /* USB -  */
//#define RESERVED            (0x0400u)  /* USB -  */
//#define RESERVED            (0x0800u)  /* USB -  */
//#define RESERVED            (0x1000u)  /* USB -  */
//#define RESERVED            (0x2000u)  /* USB -  */
//#define RESERVED            (0x4000u)  /* USB -  */
//#define RESERVED            (0x8000u)  /* USB -  */

/* USBPHYCTL Control Bits */
//#define RESERVED            (0x0010u)  /* USB -  */
//#define RESERVED            (0x0040u)  /* USB -  */
#define PUIPE_H             (0x0001u)  /* USB - PHY Single Ended Input enable */
//#define RESERVED            (0x0200u)  /* USB -  */
//#define RESERVED            (0x0100u)  /* USB -  */
//#define RESERVED            (0x0200u)  /* USB -  */
//#define RESERVED            (0x0400u)  /* USB -  */
//#define RESERVED            (0x0800u)  /* USB -  */
//#define RESERVED            (0x1000u)  /* USB -  */
//#define RESERVED            (0x2000u)  /* USB -  */
//#define RESERVED            (0x4000u)  /* USB -  */
//#define RESERVED            (0x8000u)  /* USB -  */

#define PUDIR               (0x0020u)  /* USB - Legacy Definition: USB Port Output Enable */
#define PSEIEN              (0x0100u)  /* USB - Legacy Definition: PHY Single Ended Input enable */

