arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430f5xx_6xxgeneric.h
/* ========================================================================= */
/* USB Control Registers */
/* ========================================================================= */
#define OFS_USBIEPCNF_0       (0x0020u)    /* USB Input endpoint_0: Configuration */
#define OFS_USBIEPCNT_0       (0x0021u)    /* USB Input endpoint_0: Byte Count */
#define OFS_USBOEPCNF_0       (0x0022u)    /* USB Output endpoint_0: Configuration */
#define OFS_USBOEPCNT_0       (0x0023u)    /* USB Output endpoint_0: byte count */
#define OFS_USBIEPIE          (0x002Eu)    /* USB Input endpoint interrupt enable flags */
#define OFS_USBOEPIE          (0x002Fu)    /* USB Output endpoint interrupt enable flags */
#define OFS_USBIEPIFG         (0x0030u)    /* USB Input endpoint interrupt flags */
#define OFS_USBOEPIFG         (0x0031u)    /* USB Output endpoint interrupt flags */
#define OFS_USBVECINT         (0x0032u)    /* USB Vector interrupt register */
#define OFS_USBVECINT_L        OFS_USBVECINT
#define OFS_USBVECINT_H        OFS_USBVECINT+1
#define OFS_USBMAINT          (0x0036u)    /* USB maintenance register */
#define OFS_USBMAINT_L         OFS_USBMAINT
#define OFS_USBMAINT_H         OFS_USBMAINT+1
#define OFS_USBTSREG          (0x0038u)    /* USB Time Stamp register */
#define OFS_USBTSREG_L         OFS_USBTSREG
#define OFS_USBTSREG_H         OFS_USBTSREG+1
#define OFS_USBFN             (0x003Au)    /* USB Frame number */
#define OFS_USBFN_L            OFS_USBFN
#define OFS_USBFN_H            OFS_USBFN+1
#define OFS_USBCTL            (0x003Cu)    /* USB control register */
#define OFS_USBIE             (0x003Du)    /* USB interrupt enable register */
#define OFS_USBIFG            (0x003Eu)    /* USB interrupt flag register */
#define OFS_USBFUNADR         (0x003Fu)    /* USB Function address register */

#define USBIV          USBVECINT   /* USB Vector interrupt register (alternate define) */

/* USBIEPCNF_0 Control Bits */
/* USBOEPCNF_0 Control Bits */
//#define RESERVED       (0x0001u)  /* USB -  */
//#define RESERVED       (0x0001u)  /* USB -  */
#define USBIIE         (0x0004u)  /* USB - Transaction Interrupt indication enable */
#define STALL          (0x0008u)  /* USB - Stall Condition */
//#define RESERVED       (0x0010u)  /* USB -  */
#define TOGGLE         (0x0020u)  /* USB - Toggle Bit */
//#define RESERVED       (0x0040u)  /* USB -  */
#define UBME           (0x0080u)  /* USB - UBM In-Endpoint Enable */

/* USBIEPBCNT_0 Control Bits */
/* USBOEPBCNT_0 Control Bits */
#define CNT0           (0x0001u)  /* USB - Byte Count Bit 0 */
#define CNT1           (0x0001u)  /* USB - Byte Count Bit 1 */
#define CNT2           (0x0004u)  /* USB - Byte Count Bit 2 */
#define CNT3           (0x0008u)  /* USB - Byte Count Bit 3 */
//#define RESERVED       (0x0010u)  /* USB -  */
//#define RESERVED       (0x0020u)  /* USB -  */
//#define RESERVED       (0x0040u)  /* USB -  */
#define NAK            (0x0080u)  /* USB - No Acknowledge Status Bit */

/* USBMAINT Control Bits */
#define UTIFG          (0x0001u)  /* USB - Timer Interrupt Flag */
#define UTIE           (0x0002u)  /* USB - Timer Interrupt Enable */
//#define RESERVED       (0x0004u)  /* USB -  */
//#define RESERVED       (0x0008u)  /* USB -  */
//#define RESERVED       (0x0010u)  /* USB -  */
//#define RESERVED       (0x0020u)  /* USB -  */
//#define RESERVED       (0x0040u)  /* USB -  */
//#define RESERVED       (0x0080u)  /* USB -  */
#define TSGEN          (0x0100u)  /* USB - Time Stamp Generator Enable */
#define TSESEL0        (0x0200u)  /* USB - Time Stamp Event Select Bit 0 */
#define TSESEL1        (0x0400u)  /* USB - Time Stamp Event Select Bit 1 */
#define TSE3           (0x0800u)  /* USB - Time Stamp Event #3 Bit */
//#define RESERVED       (0x1000u)  /* USB -  */
#define UTSEL0         (0x2000u)  /* USB - Timer Select Bit 0 */
#define UTSEL1         (0x4000u)  /* USB - Timer Select Bit 1 */
#define UTSEL2         (0x8000u)  /* USB - Timer Select Bit 2 */

/* USBMAINT Control Bits */
#define UTIFG_L             (0x0001u)  /* USB - Timer Interrupt Flag */
#define UTIE_L              (0x0002u)  /* USB - Timer Interrupt Enable */
//#define RESERVED       (0x0004u)  /* USB -  */
//#define RESERVED       (0x0008u)  /* USB -  */
//#define RESERVED       (0x0010u)  /* USB -  */
//#define RESERVED       (0x0020u)  /* USB -  */
//#define RESERVED       (0x0040u)  /* USB -  */
//#define RESERVED       (0x0080u)  /* USB -  */
//#define RESERVED       (0x1000u)  /* USB -  */

/* USBMAINT Control Bits */
//#define RESERVED       (0x0004u)  /* USB -  */
//#define RESERVED       (0x0008u)  /* USB -  */
//#define RESERVED       (0x0010u)  /* USB -  */
//#define RESERVED       (0x0020u)  /* USB -  */
//#define RESERVED       (0x0040u)  /* USB -  */
//#define RESERVED       (0x0080u)  /* USB -  */
#define TSGEN_H             (0x0001u)  /* USB - Time Stamp Generator Enable */
#define TSESEL0_H           (0x0002u)  /* USB - Time Stamp Event Select Bit 0 */
#define TSESEL1_H           (0x0004u)  /* USB - Time Stamp Event Select Bit 1 */
#define TSE3_H              (0x0008u)  /* USB - Time Stamp Event #3 Bit */
//#define RESERVED       (0x1000u)  /* USB -  */
#define UTSEL0_H            (0x0020u)  /* USB - Timer Select Bit 0 */
#define UTSEL1_H            (0x0040u)  /* USB - Timer Select Bit 1 */
#define UTSEL2_H            (0x0080u)  /* USB - Timer Select Bit 2 */

#define TSESEL_0       (0x0000u)  /* USB - Time Stamp Event Select: 0 */
#define TSESEL_1       (0x0200u)  /* USB - Time Stamp Event Select: 1 */
#define TSESEL_2       (0x0400u)  /* USB - Time Stamp Event Select: 2 */
#define TSESEL_3       (0x0600u)  /* USB - Time Stamp Event Select: 3 */

#define UTSEL_0        (0x0000u)  /* USB - Timer Select: 0 */
#define UTSEL_1        (0x2000u)  /* USB - Timer Select: 1 */
#define UTSEL_2        (0x4000u)  /* USB - Timer Select: 2 */
#define UTSEL_3        (0x6000u)  /* USB - Timer Select: 3 */
#define UTSEL_4        (0x8000u)  /* USB - Timer Select: 4 */
#define UTSEL_5        (0xA000u)  /* USB - Timer Select: 5 */
#define UTSEL_6        (0xC000u)  /* USB - Timer Select: 6 */
#define UTSEL_7        (0xE000u)  /* USB - Timer Select: 7 */

/* USBCTL Control Bits */
#define DIR            (0x0001u)  /* USB - Data Response Bit */
//#define RESERVED       (0x0002u)  /* USB -  */
//#define RESERVED       (0x0004u)  /* USB -  */
//#define RESERVED       (0x0008u)  /* USB -  */
#define FRSTE          (0x0010u)  /* USB - Function Reset Connection Enable */
#define RWUP           (0x0020u)  /* USB - Device Remote Wakeup Request */
#define FEN            (0x0040u)  /* USB - Function Enable Bit */
//#define RESERVED       (0x0080u)  /* USB -  */

/* USBIE Control Bits */
#define STPOWIE        (0x0001u)  /* USB - Setup Overwrite Interrupt Enable */
//#define RESERVED       (0x0002u)  /* USB -  */
#define SETUPIE        (0x0004u)  /* USB - Setup Interrupt Enable */
//#define RESERVED       (0x0008u)  /* USB -  */
//#define RESERVED       (0x0010u)  /* USB -  */
#define RESRIE         (0x0020u)  /* USB - Function Resume Request Interrupt Enable */
#define SUSRIE         (0x0040u)  /* USB - Function Suspend Request Interrupt Enable */
#define RSTRIE         (0x0080u)  /* USB - Function Reset Request Interrupt Enable */

/* USBIFG Control Bits */
#define STPOWIFG       (0x0001u)  /* USB - Setup Overwrite Interrupt Flag */
//#define RESERVED       (0x0002u)  /* USB -  */
#define SETUPIFG       (0x0004u)  /* USB - Setup Interrupt Flag */
//#define RESERVED       (0x0008u)  /* USB -  */
//#define RESERVED       (0x0010u)  /* USB -  */
#define RESRIFG        (0x0020u)  /* USB - Function Resume Request Interrupt Flag */
#define SUSRIFG        (0x0040u)  /* USB - Function Suspend Request Interrupt Flag */
#define RSTRIFG        (0x0080u)  /* USB - Function Reset Request Interrupt Flag */

