arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430f5xx_6xxgeneric.h
//values of USBVECINT when USB-interrupt occured
#define     USBVECINT_NONE                     0x00
#define     USBVECINT_PWR_DROP                 0x02
#define     USBVECINT_PLL_LOCK                 0x04
#define     USBVECINT_PLL_SIGNAL               0x06
#define     USBVECINT_PLL_RANGE                0x08
#define     USBVECINT_PWR_VBUSOn               0x0A
#define     USBVECINT_PWR_VBUSOff              0x0C
#define     USBVECINT_USB_TIMESTAMP            0x10
#define     USBVECINT_INPUT_ENDPOINT0          0x12
#define     USBVECINT_OUTPUT_ENDPOINT0         0x14
#define     USBVECINT_RSTR                     0x16
#define     USBVECINT_SUSR                     0x18
#define     USBVECINT_RESR                     0x1A
#define     USBVECINT_SETUP_PACKET_RECEIVED    0x20
#define     USBVECINT_STPOW_PACKET_RECEIVED    0x22
#define     USBVECINT_INPUT_ENDPOINT1          0x24
#define     USBVECINT_INPUT_ENDPOINT2          0x26
#define     USBVECINT_INPUT_ENDPOINT3          0x28
#define     USBVECINT_INPUT_ENDPOINT4          0x2A
#define     USBVECINT_INPUT_ENDPOINT5          0x2C
#define     USBVECINT_INPUT_ENDPOINT6          0x2E
#define     USBVECINT_INPUT_ENDPOINT7          0x30
#define     USBVECINT_OUTPUT_ENDPOINT1         0x32
#define     USBVECINT_OUTPUT_ENDPOINT2         0x34
#define     USBVECINT_OUTPUT_ENDPOINT3         0x36
#define     USBVECINT_OUTPUT_ENDPOINT4         0x38
#define     USBVECINT_OUTPUT_ENDPOINT5         0x3A
#define     USBVECINT_OUTPUT_ENDPOINT6         0x3C
#define     USBVECINT_OUTPUT_ENDPOINT7         0x3E


/* ========================================================================= */
/* USB Operation Registers */
/* ========================================================================= */

#define OFS_USBIEPSIZXY_7     (0x23FFu)    /* Input Endpoint_7: X/Y-buffer size  */
#define OFS_USBIEPBCTY_7      (0x23FEu)    /* Input Endpoint_7: Y-byte count  */
#define OFS_USBIEPBBAY_7      (0x23FDu)    /* Input Endpoint_7: Y-buffer base addr.  */
//#define    Spare_O    (0x23FCu)   /* Not used  */
//#define    Spare_O    (0x23FBu)   /* Not used  */
#define OFS_USBIEPBCTX_7      (0x23FAu)    /* Input Endpoint_7: X-byte count  */
#define OFS_USBIEPBBAX_7      (0x23F9u)    /* Input Endpoint_7: X-buffer base addr. */
#define OFS_USBIEPCNF_7       (0x23F8u)    /* Input Endpoint_7: Configuration  */
#define OFS_USBIEPSIZXY_6     (0x23F7u)    /* Input Endpoint_6: X/Y-buffer size  */
#define OFS_USBIEPBCTY_6      (0x23F6u)    /* Input Endpoint_6: Y-byte count */
#define OFS_USBIEPBBAY_6      (0x23F5u)    /* Input Endpoint_6: Y-buffer base addr. */
//#define    Spare_O    (0x23F4u)   /* Not used  */
//#define    Spare_O    (0x23F3u)   /* Not used  */
#define OFS_USBIEPBCTX_6      (0x23F2u)    /* Input Endpoint_6: X-byte count */
#define OFS_USBIEPBBAX_6      (0x23F1u)    /* Input Endpoint_6: X-buffer base addr. */
#define OFS_USBIEPCNF_6       (0x23F0u)    /* Input Endpoint_6: Configuration */
#define OFS_USBIEPSIZXY_5     (0x23EFu)    /* Input Endpoint_5: X/Y-buffer size */
#define OFS_USBIEPBCTY_5      (0x23EEu)    /* Input Endpoint_5: Y-byte count */
#define OFS_USBIEPBBAY_5      (0x23EDu)    /* Input Endpoint_5: Y-buffer base addr. */
//#define    Spare_O    (0x23ECu)   /* Not used */
//#define    Spare_O    (0x23EBu)   /* Not used */
#define OFS_USBIEPBCTX_5      (0x23EAu)    /* Input Endpoint_5: X-byte count */
#define OFS_USBIEPBBAX_5      (0x23E9u)    /* Input Endpoint_5: X-buffer base addr. */
#define OFS_USBIEPCNF_5       (0x23E8u)    /* Input Endpoint_5: Configuration */
#define OFS_USBIEPSIZXY_4     (0x23E7u)    /* Input Endpoint_4: X/Y-buffer size */
#define OFS_USBIEPBCTY_4      (0x23E6u)    /* Input Endpoint_4: Y-byte count */
#define OFS_USBIEPBBAY_4      (0x23E5u)    /* Input Endpoint_4: Y-buffer base addr. */
//#define    Spare_O    (0x23E4u)   /* Not used */
//#define    Spare_O    (0x23E3u)   /* Not used */
#define OFS_USBIEPBCTX_4      (0x23E2u)    /* Input Endpoint_4: X-byte count */
#define OFS_USBIEPBBAX_4      (0x23E1u)    /* Input Endpoint_4: X-buffer base addr. */
#define OFS_USBIEPCNF_4       (0x23E0u)    /* Input Endpoint_4: Configuration */
#define OFS_USBIEPSIZXY_3     (0x23DFu)    /* Input Endpoint_3: X/Y-buffer size */
#define OFS_USBIEPBCTY_3      (0x23DEu)    /* Input Endpoint_3: Y-byte count */
#define OFS_USBIEPBBAY_3      (0x23DDu)    /* Input Endpoint_3: Y-buffer base addr. */
//#define    Spare_O    (0x23DCu)   /* Not used */
//#define    Spare_O    (0x23DBu)   /* Not used */
#define OFS_USBIEPBCTX_3      (0x23DAu)    /* Input Endpoint_3: X-byte count */
#define OFS_USBIEPBBAX_3      (0x23D9u)    /* Input Endpoint_3: X-buffer base addr. */
#define OFS_USBIEPCNF_3       (0x23D8u)    /* Input Endpoint_3: Configuration */
#define OFS_USBIEPSIZXY_2     (0x23D7u)    /* Input Endpoint_2: X/Y-buffer size */
#define OFS_USBIEPBCTY_2      (0x23D6u)    /* Input Endpoint_2: Y-byte count */
#define OFS_USBIEPBBAY_2      (0x23D5u)    /* Input Endpoint_2: Y-buffer base addr. */
//#define    Spare_O    (0x23D4u)   /* Not used */
//#define    Spare_O    (0x23D3u)   /* Not used */
#define OFS_USBIEPBCTX_2      (0x23D2u)    /* Input Endpoint_2: X-byte count */
#define OFS_USBIEPBBAX_2      (0x23D1u)    /* Input Endpoint_2: X-buffer base addr. */
#define OFS_USBIEPCNF_2       (0x23D0u)    /* Input Endpoint_2: Configuration */
#define OFS_USBIEPSIZXY_1     (0x23CFu)    /* Input Endpoint_1: X/Y-buffer size */
#define OFS_USBIEPBCTY_1      (0x23CEu)    /* Input Endpoint_1: Y-byte count */
#define OFS_USBIEPBBAY_1      (0x23CDu)    /* Input Endpoint_1: Y-buffer base addr. */
//#define    Spare_O    (0x23CCu)   /* Not used */
//#define    Spare_O    (0x23CBu)   /* Not used */
#define OFS_USBIEPBCTX_1      (0x23CAu)    /* Input Endpoint_1: X-byte count */
#define OFS_USBIEPBBAX_1      (0x23C9u)    /* Input Endpoint_1: X-buffer base addr. */
#define OFS_USBIEPCNF_1       (0x23C8u)    /* Input Endpoint_1: Configuration */
//#define       (0x23C7)_O   /* */
//#define     RESERVED_O      (0x1C00u)    /* */
//#define       (0x23C0)_O   /* */
#define OFS_USBOEPSIZXY_7     (0x23BFu)    /* Output Endpoint_7: X/Y-buffer size */
#define OFS_USBOEPBCTY_7      (0x23BEu)    /* Output Endpoint_7: Y-byte count */
#define OFS_USBOEPBBAY_7      (0x23BDu)    /* Output Endpoint_7: Y-buffer base addr. */
//#define    Spare_O    (0x23BCu)   /* Not used */
//#define    Spare_O    (0x23BBu)   /* Not used */
#define OFS_USBOEPBCTX_7      (0x23BAu)    /* Output Endpoint_7: X-byte count */
#define OFS_USBOEPBBAX_7      (0x23B9u)    /* Output Endpoint_7: X-buffer base addr. */
#define OFS_USBOEPCNF_7       (0x23B8u)   /* Output Endpoint_7: Configuration */
#define OFS_USBOEPSIZXY_6     (0x23B7u)    /* Output Endpoint_6: X/Y-buffer size */
#define OFS_USBOEPBCTY_6      (0x23B6u)    /* Output Endpoint_6: Y-byte count */
#define OFS_USBOEPBBAY_6      (0x23B5u)    /* Output Endpoint_6: Y-buffer base addr. */
//#define    Spare_O    (0x23B4u)   /* Not used */
//#define    Spare_O    (0x23B3u)   /* Not used */
#define OFS_USBOEPBCTX_6      (0x23B2u)    /* Output Endpoint_6: X-byte count */
#define OFS_USBOEPBBAX_6      (0x23B1u)    /* Output Endpoint_6: X-buffer base addr. */
#define OFS_USBOEPCNF_6       (0x23B0u)    /* Output Endpoint_6: Configuration */
#define OFS_USBOEPSIZXY_5     (0x23AFu)    /* Output Endpoint_5: X/Y-buffer size */
#define OFS_USBOEPBCTY_5      (0x23AEu)    /* Output Endpoint_5: Y-byte count */
#define OFS_USBOEPBBAY_5      (0x23ADu)    /* Output Endpoint_5: Y-buffer base addr. */
//#define    Spare_O    (0x23ACu)   /* Not used */
//#define    Spare_O    (0x23ABu)   /* Not used */
#define OFS_USBOEPBCTX_5      (0x23AAu)    /* Output Endpoint_5: X-byte count */
#define OFS_USBOEPBBAX_5      (0x23A9u)    /* Output Endpoint_5: X-buffer base addr. */
#define OFS_USBOEPCNF_5       (0x23A8u)    /* Output Endpoint_5: Configuration */
#define OFS_USBOEPSIZXY_4     (0x23A7u)    /* Output Endpoint_4: X/Y-buffer size */
#define OFS_USBOEPBCTY_4      (0x23A6u)    /* Output Endpoint_4: Y-byte count */
#define OFS_USBOEPBBAY_4      (0x23A5u)    /* Output Endpoint_4: Y-buffer base addr. */
//#define    Spare_O    (0x23A4u)   /* Not used */
//#define    Spare_O    (0x23A3u)   /* Not used */
#define OFS_USBOEPBCTX_4      (0x23A2u)    /* Output Endpoint_4: X-byte count */
#define OFS_USBOEPBBAX_4      (0x23A1u)    /* Output Endpoint_4: X-buffer base addr. */
#define OFS_USBOEPCNF_4       (0x23A0u)    /* Output Endpoint_4: Configuration */
#define OFS_USBOEPSIZXY_3     (0x239Fu)    /* Output Endpoint_3: X/Y-buffer size */
#define OFS_USBOEPBCTY_3      (0x239Eu)    /* Output Endpoint_3: Y-byte count */
#define OFS_USBOEPBBAY_3      (0x239Du)    /* Output Endpoint_3: Y-buffer base addr. */
//#define    Spare_O    (0x239Cu)   /* Not used */
//#define    Spare_O    (0x239Bu)   /* Not used */
#define OFS_USBOEPBCTX_3      (0x239Au)    /* Output Endpoint_3: X-byte count */
#define OFS_USBOEPBBAX_3      (0x2399u)    /* Output Endpoint_3: X-buffer base addr. */
#define OFS_USBOEPCNF_3       (0x2398u)    /* Output Endpoint_3: Configuration */
#define OFS_USBOEPSIZXY_2     (0x2397u)    /* Output Endpoint_2: X/Y-buffer size */
#define OFS_USBOEPBCTY_2      (0x2396u)    /* Output Endpoint_2: Y-byte count */
#define OFS_USBOEPBBAY_2      (0x2395u)    /* Output Endpoint_2: Y-buffer base addr. */
//#define    Spare_O    (0x2394u)   /* Not used */
//#define    Spare_O    (0x2393u)   /* Not used */
#define OFS_USBOEPBCTX_2      (0x2392u)    /* Output Endpoint_2: X-byte count */
#define OFS_USBOEPBBAX_2      (0x2391u)    /* Output Endpoint_2: X-buffer base addr. */
#define OFS_USBOEPCNF_2       (0x2390u)    /* Output Endpoint_2: Configuration */
#define OFS_USBOEPSIZXY_1     (0x238Fu)    /* Output Endpoint_1: X/Y-buffer size */
#define OFS_USBOEPBCTY_1      (0x238Eu)    /* Output Endpoint_1: Y-byte count */
#define OFS_USBOEPBBAY_1      (0x238Du)    /* Output Endpoint_1: Y-buffer base addr. */
//#define    Spare_O    (0x238Cu)   /* Not used */
//#define    Spare_O    (0x238Bu)   /* Not used */
#define OFS_USBOEPBCTX_1      (0x238Au)    /* Output Endpoint_1: X-byte count */
#define OFS_USBOEPBBAX_1      (0x2389u)    /* Output Endpoint_1: X-buffer base addr. */
#define OFS_USBOEPCNF_1       (0x2388u)    /* Output Endpoint_1: Configuration */
#define OFS_USBSUBLK          (0x2380u)    /* Setup Packet Block */
#define OFS_USBIEP0BUF        (0x2378u)    /* Input endpoint_0 buffer */
#define OFS_USBOEP0BUF        (0x2370u)    /* Output endpoint_0 buffer */
#define OFS_USBTOPBUFF        (0x236Fu)    /* Top of buffer space */
//         (1904 Bytes)               /* Buffer space */
#define OFS_USBSTABUFF        (0x1C00u)    /* Start of buffer space */

/* USBIEPCNF_n Control Bits */
/* USBOEPCNF_n Control Bits */
//#define RESERVED       (0x0001u)  /* USB -  */
//#define RESERVED       (0x0001u)  /* USB -  */
#define DBUF           (0x0010u)  /* USB - Double Buffer Enable */
//#define RESERVED       (0x0040u)  /* USB -  */

/* USBIEPBCNT_n Control Bits */
/* USBOEPBCNT_n Control Bits */
#define CNT4           (0x0010u)  /* USB - Byte Count Bit 3 */
#define CNT5           (0x0020u)  /* USB - Byte Count Bit 3 */
#define CNT6           (0x0040u)  /* USB - Byte Count Bit 3 */
#endif
/************************************************************
* USCI Ax
************************************************************/
#ifdef  __MSP430_HAS_USCI_Ax__       /* Definition to show that Module is available */

#define OFS_UCAxCTLW0         (0x0000u)  /* USCI Ax Control Word Register 0 */
#define OFS_UCAxCTLW0_L        OFS_UCAxCTLW0
#define OFS_UCAxCTLW0_H        OFS_UCAxCTLW0+1
#define OFS_UCAxCTL0          (0x0001u)
#define OFS_UCAxCTL1          (0x0000u)
#define UCAxCTL1            UCAxCTLW0_L  /* USCI Ax Control Register 1 */
#define UCAxCTL0            UCAxCTLW0_H  /* USCI Ax Control Register 0 */
#define OFS_UCAxBRW           (0x0006u)  /* USCI Ax Baud Word Rate 0 */
#define OFS_UCAxBRW_L          OFS_UCAxBRW
#define OFS_UCAxBRW_H          OFS_UCAxBRW+1
#define OFS_UCAxBR0           (0x0006u)
#define OFS_UCAxBR1           (0x0007u)
#define UCAxBR0             UCAxBRW_L /* USCI Ax Baud Rate 0 */
#define UCAxBR1             UCAxBRW_H /* USCI Ax Baud Rate 1 */
#define OFS_UCAxMCTL          (0x0008u)  /* USCI Ax Modulation Control */
#define OFS_UCAxSTAT          (0x000Au)  /* USCI Ax Status Register */
#define OFS_UCAxRXBUF         (0x000Cu)  /* USCI Ax Receive Buffer */
#define OFS_UCAxTXBUF         (0x000Eu)  /* USCI Ax Transmit Buffer */
#define OFS_UCAxABCTL         (0x0010u)  /* USCI Ax LIN Control */
#define OFS_UCAxIRCTL         (0x0012u)  /* USCI Ax IrDA Transmit Control */
#define OFS_UCAxIRCTL_L        OFS_UCAxIRCTL
#define OFS_UCAxIRCTL_H        OFS_UCAxIRCTL+1
#define OFS_UCAxIRTCTL        (0x0012u)
#define OFS_UCAxIRRCTL        (0x0013u)
#define UCAxIRTCTL          UCAxIRCTL_L  /* USCI Ax IrDA Transmit Control */
#define UCAxIRRCTL          UCAxIRCTL_H  /* USCI Ax IrDA Receive Control */
#define OFS_UCAxICTL          (0x001Cu)  /* USCI Ax Interrupt Enable Register */
#define OFS_UCAxICTL_L         OFS_UCAxICTL
#define OFS_UCAxICTL_H         OFS_UCAxICTL+1
#define OFS_UCAxIE            (0x001Cu)
#define OFS_UCAxIFG           (0x001Du)
#define UCAxIE              UCAxICTL_L  /* USCI Ax Interrupt Enable Register */
#define UCAxIFG             UCAxICTL_H  /* USCI Ax Interrupt Flags Register */
#define OFS_UCAxIV            (0x001Eu)  /* USCI Ax Interrupt Vector Register */

#define OFS_UCAxCTLW0__SPI    (0x0000u)
#define OFS_UCAxCTLW0__SPI_L   OFS_UCAxCTLW0__SPI
#define OFS_UCAxCTLW0__SPI_H   OFS_UCAxCTLW0__SPI+1
#define OFS_UCAxCTL0__SPI     (0x0001u)
#define OFS_UCAxCTL1__SPI     (0x0000u)
#define OFS_UCAxBRW__SPI      (0x0006u)
#define OFS_UCAxBRW__SPI_L     OFS_UCAxBRW__SPI
#define OFS_UCAxBRW__SPI_H     OFS_UCAxBRW__SPI+1
#define OFS_UCAxBR0__SPI      (0x0006u)
#define OFS_UCAxBR1__SPI      (0x0007u)
#define OFS_UCAxMCTL__SPI     (0x0008u)
#define OFS_UCAxSTAT__SPI     (0x000Au)
#define OFS_UCAxRXBUF__SPI    (0x000Cu)
#define OFS_UCAxTXBUF__SPI    (0x000Eu)
#define OFS_UCAxICTL__SPI     (0x001Cu)
#define OFS_UCAxICTL__SPI_L    OFS_UCAxICTL__SPI
#define OFS_UCAxICTL__SPI_H    OFS_UCAxICTL__SPI+1
#define OFS_UCAxIE__SPI       (0x001Cu)
#define OFS_UCAxIFG__SPI      (0x001Du)
#define OFS_UCAxIV__SPI       (0x001Eu)

#endif
/************************************************************
* USCI Bx
************************************************************/
#ifdef  __MSP430_HAS_USCI_Bx__        /* Definition to show that Module is available */

